{
    "inicio":{
        "p1":"恭喜啦",
        "p2":"我将立即与您分享其中一种可能的方式 您可以学习编程语言。",
        "p3":"我将以我的经验与您交谈，希望对您有所帮助。",
        "p4":"如果您还没有决定，或者目前您不感兴趣，则付费课程或大学学位是超级有效的选择，但我提供的信息将是最有吸引力的。",
        "p5":"在这里，您将找到书籍，网站，提示，代码示例。一切都井井有条，因此您可以决定做什么和如何做。",
        "p6":"如果可以的话，请相信我，您也可以。您甚至可以改善这条道路，并向那些追随您的人指出。",
        "p7":"也许有一天，您将解决诸如此类的问题，并且您会发现魔术确实存在："
    },
    "navBar":{
        "p1":"开始",
        "p2":"联络我"
    },
    "footer":{
        "p1":"十月"
    },
    "page404":{
        "p1":"404 - 未找到! ",
        "p2":" 不存在... ",
        "p3":"开始"
    },
    "contacto":{
        "p1":"开心点！",
        "p2":"进行交谈，分享知识并保持联系是任何理由。",
        "p3":"你的名字",
        "p4":"告诉我你的故事...",
        "p5":"发送",
        "p6":"email@例.com"

    },
    "mapView":{
        "p1":"嗨！ "

    },
    "buttonTop":{
        "p1":"向上"

    },
    "metaTags":{
        "p1":"学习Python和JavaScript的热门网站。图书。提示。代码示例。"
    },
    "paypalButton":{
        "p1":"邀请我喝咖啡。"
    },
    "myHistoryJS":{
        "p1":"我的JavaScript故事",
        "p2":"您以为旅行会在那儿结束，对吧？",
        "p3":"人类，无论好坏，都非常不满意，并且总是想要更多。",
        "p4":"我很好奇……我当然相信，只要有一点奉献，一切都是不可能的，无论如何，学习总是比我完全不知道时要快。",
        "p5":"因此，在使用Python七个月之后，我开始学习JavaScript（也包括HTML和CSS），因为我被Web开发所吸引，尤其是被称为Front-End的部分。除此之外，Javascript还被认为是一种比其他语言更简单的编程语言。只需在计算机上安装Web浏览器，便可以在集成的控制台中执行操作。一个奇迹。",
        "p6":"我告诉您，尽管您可以选择所需的程序来自动完成和修改代码，但是我对Visual Studio Code的了解却有很大的趋势。我已经知道为什么了。从此处安装：",
        "p7":"如今，Javascript是世界上最受欢迎的语言之一，用于向网页，过程数据添加交互性以及创建不同类型的应用程序（移动应用程序，桌面应用程序，游戏等）。",
        "p8":"在我的另一个故事中提到的网站上有个人资料后，我致力于研究问题和收集信息以进行学习。我强调说，我总是访问SoloLearn移动应用程序以掌握该语言的第一种方法，之后我会自动使用",
        "p9":"进行学习和练习。以上内容，以及我将立即与您分享的书籍，我认为是最有趣的混合物。",
        "p10":"为了不失习惯，在这里，我向您展示我一开始所做的一些程序：",
        "p11":"在某个时候，我开始与我的妻子谈论十二生肖，但我手头没有任何信息来澄清日期等某些细节。因此，我认真用这种语言所做的第一件事是：",
        "p12":"有一天，我想进入一家餐厅，试图模仿这条线。在这里，我向您展示：",
        "p13":"在我以前的工作中，考虑到经纬仪的停车坐标和方向，有必要能够计算出放样角度和第三点的距离。我通过以下方式解决了这个问题：",
        "p14":"好吧，这就是我目前所处的位置。我正在研究一个称为React.js的JavaScript库。与她一起我正在做这种博客，在这里我向您展示我所遵循的道路，并在这一领域中广为人知。我认为这些信息很有用，因为我希望我一开始就发现类似的东西。",
        "p15":"随着时间和实践的发展，我希望能够制作出动态且有趣的网页。每次总是一步，没有什么比一天又一天美丽。这仅仅是开始。",
        "p16":"至此，我与您分享了最好的网站，不仅可以学习HTML5，CCS3和JavaScript，还可以学习Python和更多内容：",
        "p17":"如果您想学习Javascript并因此学习网络开发，我相信您不会以相同的方式看到网络浏览器。",
        "p18":"在网络上见。"
    },
    "myHistoryPython":{
        "p1":"我与Python的历史",
        "p2":"在2019年10月，我开始进入编程世界。",
        "p3":"真！？",
        "p4":"如果我说以上的话，那是不公平的。",
        "p5":"我一直着迷于编程，只是不了解当前的决心。在大学预科课程中，我早在1995年就开始使用“ MSX-Basic”，但仅此而已。",
        "p6":"时间流逝，尽管我渴望在计算机上工作，但是当我要面对一些其他问题时，我的工作选择仅收敛于Microsoft Excel中的电子表格。",
        "p7":"我还不知道如何用任何语言编程（但：P），但是我确信，当我要面对问题，使工作活动更容易等时，拥有这项技能会很有用。",
        "p8":"一直以来，我认为我可以使自己的活动自动化的想法困扰着我，但是该怎么做……，在38岁的时候，没有太多的学习时间，就会出现以下问题：",
        "p9":"哪种编程语言具有柔和的学习曲线，并且可以用于许多活动？",
        "p10":"可能还有其他人，但是Python改变了我的生活。",
        "p11":"Python是一种高级编程语言，其应用广泛，包括Web开发，脚本，科学计算和人工智能。",
        "p12":"我不打算深入探讨它的内在内容，但我将与您分享我所养育的一切，使自己沉浸于按时间顺序排列的这种语言。然后，我会给您最好的建议以学习它。",
        "p13":"首先是从以下官方页面安装Python：",
        "p14":"第二件事是寻找一个程序，该程序可以帮助我们实现代码自动完成，建议和其他功能。在我要向您建议的YouTube课程中，第4点，老师选择了“ Sublime Text 3”。我推荐相同的方法，尽管稍后您会发现其他您可能感兴趣的方法。您可以在这里下载：",
        "p15":"顾名思义，这本书是面向初学者的，它通过简单的示例进行了很好的安排。您应该记住，这本书是关于Python 2的，并且针对您肯定要安装的版本（Python 3）进行了一些语法更改，因此会有差异，例如print 2 + 3 vs print（2 + 3）等。但是为什么要指出阳光下的斑点呢:)",
        "p16":"YouTube课程“Píldoras Informáticas”。胡安·迪亚兹 Juan Díaz 教授将带领您完成一段精妙的旅程，在该旅程中，教学法和教学法将影响您的程序员。学完本课程后，您一定可以创建自己的第一个程序，对此您将永远感到骄傲。访问它，看看您的想法：",
        "p17":"网站",
        "p18":"JuanJoséLozanoGómez教授将带您一窥更符合实际情况的编程。它将向您展示执行不同活动的不同框架。您将认识到“ Python”本身仅仅是个开始，而这只会变得更好。然后成为一名高级pythonist。",
        "p19":"移动应用程序：“ SoloLearn”。通过移动设备上的该应用程序，您可以选择一门课程（在这种情况下为Python），以一种非常客观的方式来学习，并结合理论和问题加以加强。因此，您可以在休息或躺在床上的任何地方学习。这个应用程序有几个选项，您会发现它很有趣。此外，如果您有任何疑问，它也可以作为咨询的来源。他们的社区很活跃，您可以使用自己喜欢的语言来挑战他们。似乎以上所有条件还不够，一旦完成课程，您将获得支持它的数字证书。大。如果您使用的是计算机，我希望与您共享此链接，以供您熟悉：",
        "p20":"在上述所有操作中，为什么不在不同的网站上创建个人资料，在这些网站上您可以提问，邮政编码或在这个世界上广为人知：",
        "p21":"在这里您可以提出自己的特定问题，必须遵循一些创建个人资料并按照页面上的说明学习的模式。",
        "p22":"您将能够上传所有想要的代码以及更多内容。我认为，您必须在这里拥有可以为您提供的所有优势的帐户。",
        "p23":"我希望有一个网站，考虑到您的代码和其他变量，可以创建一个排名并绘制您的活动图表，以便可以轻松地显示该活动……它的存在并令人赞叹。",
        "p24":"既然我们在这里，为什么不对所有法律都进行职务介绍。您会同意我的观点，没有比这更好的地方了。必须以这种方式让自己知名。招聘人员不断检查谁是有才华的，从而吸引他们，也许是理想的工作。",
        "p25":"您是否认为自己已掌握知识并想挑战自己？好了，该进行酸测试了。我将与您分享一个我上瘾的页面：",
        "p26":"在其中，您将能够以一种有趣且动态的方式来使用它所提供的语言进行练习，并通过许多数据输入来正确地测试您的代码，并且如果您准备就绪可以参加考试以证明您的知识并获得文凭，那似乎还不够。老实说，我没有发现更好的东西。",
        "p27":"当您对rgb颜色（25、169、77）感到有些无聊时，我建议您在另一页上练习技能:",
        "p28":"荣誉老师，我们来练习katas！",
        "p29":"振作起来，一旦这次旅行开始，一切都会像以前一样。",
        "p30":"如果您提早开始，作为一个强大的盟友，您将能够面对任务。如果您的年龄与我的年龄相似，那么您无法解决的问题以及在夜间折磨的那些问题都可以执行",
        "p31":"现在，我提到一些我开始满足自己的担忧时所执行的程序：",
        "p32":"我最喜欢的运动是足球，而且我做得很认真，第一个程序是足球世界杯模拟器，我还没有添加几率，因为现在所有结果都是随机的，但是当我完成时它是令人满意的。在",
        "p33":"上，他们回答了我的特定问题，这就是我边做边学的方式。在这里享受代码的乐趣：",
        "p34":"我曾经在一个货物运输的地方工作。这些货物装在容器中。我记得我和我的同事们花费了大量的时间来查找有关包含大量信息的Microsoft Excel工作表中某个容器的信息。您可以在此处找到优化搜索的代码：",
        "p35":"有一天，我和一位朋友聊天，为了做出一个决定，我们决定玩石头剪刀布。我输了，不得不做这份工作。他吹牛说他从来没有输过，因为他读过我的情感。我回到家，第二天去见他。看看我给你看的东西：",
        "p36":"难以置信的真实吗？",
        "p37":"像开始时的所有开始一样，学习新东西会很慢。但是，您很快就会嘲笑所有这一切。",
        "p38":"所以…",
        "p39":"您准备好获得关于学习的最佳建议的知识，而不仅仅是学习编程，而是学习这一生中的任何东西？",
        "p40":"永不放弃。切勿听别人说您在浪费时间，或者您很小，或者您很老。与拥有相同品味的朋友相处。问问自己问题以及解决问题的方式。练习并记住。最好的还在后头！",
        "p41":"PS：以下是与您相关的其他书籍，您可以查阅：",
        "p42":"开始工作，使用Python环绕自己，使用互联网，交谈，聆听，练习，最重要的是要有乐趣。"
        
    }

}