{
    "inicio":{
        "p1":"willkommen",
        "p2":"Ich werde Ihnen sofort eine der möglichen Möglichkeiten mitteilen, wie Sie können eine Programmiersprache lernen.",
        "p3":"Ich werde aus meiner Erfahrung mit Ihnen sprechen und hoffe, dass es Ihnen hilfreich sein wird.",
        "p4":"Ein bezahlter Kurs oder ein Universitätsabschluss sind super gültige Optionen, ABER wenn Sie sich noch nicht entschieden haben oder es im Moment nicht von Ihrem Interesse ist, sind die Informationen, die ich präsentiere, am attraktivsten.",
        "p5":"Hier finden Sie Bücher, Websites, Tipps, Codebeispiele. Alles auf organisierte Weise, damit Sie entscheiden können, was und wie zu tun ist.",
        "p6":"Wenn ich kann, glauben Sie mir, können Sie auch. Sie können den Pfad sogar verbessern und darauf hinweisen an diejenigen, die nach dir kommen.",
        "p7":"Vielleicht werden Sie eines Tages so etwas lösen und sehen, dass Magie existiert:"
    },
    "navBar":{
        "p1":"Start",
        "p2":"Kontaktiere mich"
    },
    "footer":{
        "p1":"Oktober "
    },
    "page404":{
        "p1":"404 - Nicht gefunden! ",
        "p2":" ist nicht vorhanden... ",
        "p3":"Start"
    },
    "contacto":{
        "p1":"Aufheitern! ",
        "p2":"Jeder Grund ist gut zu reden, Wissen zu teilen und in Kontakt zu bleiben.",
        "p3":"dein Name",
        "p4":"Erzähl mir deine Geschichte...",
        "p5":"Senden",
        "p6":"email@beispiel.com"
    },
    "mapView":{
        "p1":"Hallo! "

    },
    "buttonTop":{
        "p1":"oben "

    },
    "metaTags":{
        "p1":"Top-Websites zum Erlernen von Python und JavaScript. Bücher. Tipps. Codebeispiele. "

    },
    "paypalButton":{
        "p1":"lade mich zu einem Kaffee. "
    },
    "myHistoryJS":{
        "p1":"meine Geschichte mit JavaScript",
        "p2":"Sie dachten, die Reise würde dort enden, oder?",
        "p3":"Der Mensch, ob gut oder schlecht, ist ziemlich unzufrieden und will immer mehr.",
        "p4":"Ich war neugierig… Ich glaube sicherlich, dass mit ein wenig Engagement nichts unmöglich ist und das Lernen sowieso immer schneller sein wird, als wenn ich überhaupt keine Ahnung hätte.",
        "p5":"Nach 7 Monaten mit Python lernte ich JavaScript (auch HTML und CSS), weil ich mich für die Webentwicklung interessierte, insbesondere für den als Front-End bekannten Teil. Außerdem wird Javascript als weniger komplizierte Programmiersprache angesehen als andere. Wenn nur der Webbrowser auf Ihrem Computer installiert ist, können Sie Dinge in der integrierten Konsole tun. Ein Wunder.",
        "p6":"Ich sage Ihnen, obwohl Sie das gewünschte Programm für die automatische Vervollständigung und Überarbeitung Ihres Codes auswählen können, gibt es bei meinen Bekannten aus Visual Studio Code einen starken Trend. Mir ist schon klar warum. Installieren Sie es von hier aus:",
        "p7":"Heute ist Javascript eine der beliebtesten Sprachen der Welt und wird verwendet, um Webseiten interaktiv zu gestalten, Daten zu verarbeiten und verschiedene Arten von Anwendungen zu erstellen (mobile Anwendungen, Desktop-Anwendungen, Spiele usw.).",
        "p8":"Mit Profilen auf den in meiner anderen Geschichte erwähnten Websites widmete ich mich dem Stellen von Fragen und dem Sammeln von Informationen zum Lernen. Ich betone, dass ich immer auf die mobile SoloLearn-Anwendung zugreife, um den ersten Zugang zur Sprache zu erhalten, und danach automatisch",
        "p9":"verwende, um sie zu studieren und zu üben. Zusammen mit den Büchern, die ich sofort mit Ihnen teilen werde, halte ich das oben Gesagte für eine Mischung der interessantesten.",
        "p10":"Um die Gewohnheit nicht zu verlieren, zeige ich Ihnen hier einige Programme, die ich am Anfang gemacht habe:",
        "p11":"Irgendwann fange ich an, mit meiner Frau über die Tierkreiszeichen zu sprechen, und ich hatte keine Informationsquelle zur Hand, um bestimmte Details mit den Daten usw. zu klären. Das erste, was ich ernsthaft in dieser Sprache tat, war das Folgende:",
        "p12":"Eines Tages wartete ich darauf, ein Restaurant zu betreten, als mir der Gedanke kam, die Linie zu simulieren. Hier zeige ich Ihnen: ",
        "p13":"In meiner alten Arbeit war es angesichts der Parkkoordinaten und der Ausrichtung eines Theodoliten notwendig, den Absteckwinkel und die Entfernung eines dritten Punktes berechnen zu können. Ich habe es folgendermaßen gelöst:",
        "p14":"Nun, das ist es, woran ich gerade bin. Ich studiere eine JavaScript-Bibliothek namens React.js. Mit ihr mache ich diese Art von Blog, in dem ich Ihnen den Weg zeige, den ich gegangen bin, und mich auch in diesem Bereich bekannt mache. Ich denke, diese Informationen können einfach nützlich sein, weil ich wünschte, ich hätte zu Beginn etwas Ähnliches gefunden.",
        "p15":"Mit Zeit und Übung hoffe ich, dynamische und interessante Webseiten erstellen zu können. Immer einen Schritt nach dem anderen, dass es nichts Schöneres gibt als einen Tag nach dem anderen. Dies ist nur der Anfang.",
        "p16":"An dieser Stelle teile ich Ihnen die beste Website, um nicht nur HTML5, CCS3 und JavaScript, sondern auch Python und vieles mehr zu lernen:",
        "p17":"Wenn Sie Javascript und damit die Webentwicklung lernen möchten, werden Sie Ihren Webbrowser sicher nicht auf die gleiche Weise sehen.",
        "p18":"Wir sehen uns in den Netzwerken."
    },
    "myHistoryPython":{
        "p1":"meine Geschichte mit Python",
        "p2":"Im Oktober 2019 begann meine Reise in die Welt des Programmierens.",
        "p3":"Ja wirklich!?",
        "p4":"Es wäre nicht fair, wenn ich das oben Gesagte sagen würde.",
        "p5":"Ich war schon immer fasziniert von der Programmierung, nur nicht mit der aktuellen Entschlossenheit. In der Voruniversität machte ich 1995 meine ersten Schritte mit „MSX-Basic“, aber da war alles.",
        "p6":"Die Zeit verging und obwohl ich unbedingt am Computer arbeiten wollte, konvergierten meine Joboptionen nur in einer Tabelle in Microsoft Excel, wenn ich auf ein zusätzliches Problem stieß.",
        "p7":"Ich wusste noch nicht, wie man in einer Sprache programmiert (noch: P), aber ich war mir sicher, dass diese Fähigkeit nützlich sein könnte, wenn ich auf ein Problem stoßen, eine Arbeitstätigkeit erleichtern usw.",
        "p8":"Immer die Idee, dass ich meine Aktivitäten automatisieren könnte, verfolgte mich, aber was zu tun ist ... Mit 38 Jahren, ohne viel Zeit zum Lernen, stellt sich die folgende Frage:",
        "p9":"Welche Programmiersprache hat eine sanfte Lernkurve und kann für viele Aktivitäten verwendet werden?",
        "p10":"Es mag andere geben, aber Python hat mein Leben verändert.",
        "p11":"Python ist eine Programmiersprache auf hohem Niveau mit Anwendungen in zahlreichen Bereichen, einschließlich Webentwicklung, Skripterstellung, wissenschaftlichem Rechnen und künstlicher Intelligenz.",
        "p12":"Ich werde nicht auf die Innenseiten eingehen, aber ich werde mit Ihnen alles teilen, womit ich mich ernährt habe, um in diese chronologisch geordnete Sprache einzutauchen. Dann werde ich Ihnen den besten Rat geben, um es zu lernen.",
        "p13":"Als erstes installieren Sie Python von der offiziellen Seite:",
        "p14":"Die zweite Sache ist, nach einem Programm zu suchen, das uns bei der automatischen Vervollständigung von Code, Vorschlägen und anderen Funktionen hilft. In dem Youtube-Kurs, den ich Ihnen in Punkt 4 vorschlagen werde, hat der Lehrer Sublime Text 3 gewählt. Ich empfehle dasselbe, obwohl Sie später andere finden werden, die für Sie von Interesse sein könnten. Sie können es hier herunterladen:",
        "p15":"Wie der Name schon sagt, ist dieses Buch für Anfänger gedacht und bietet einfache Beispiele. Sie sollten bedenken, dass es in diesem Buch um Python 2 und einige Syntaxänderungen in Bezug auf die Version geht, die Sie sicher installieren werden (Python 3), sodass es Unterschiede gibt, z. B. print 2 + 3 vs print (2 + 3) usw. . Aber warum auf Flecken in der Sonne hinweisen :)",
        "p16":"Youtube-Kurs Píldoras Informáticas. Professor Juan Díaz wird Sie auf einer exquisiten Reise an der Hand nehmen, auf der Pädagogik und Didaktik den Programmierer in Ihnen prägen werden. Nach diesem Kurs können Sie sicherlich Ihre ersten Programme erstellen, auf die Sie immer stolz sein werden. Besuchen Sie es und sehen Sie, was Sie denken:",
        "p17":"Website",
        "p18":"Professor Juan José Lozano Gómez gibt Ihnen einen Einblick in die Programmierung, die kontextualisierter zur Realität ist. Es zeigt Ihnen verschiedene Frameworks, um verschiedene Aktivitäten auszuführen. Sie werden feststellen, dass Python selbst nur der Anfang ist und dass dies nur besser werden könnte. Dann werde ein Python-Meister.",
        "p19":"Mobile Anwendung: SoloLearn. Mit dieser Anwendung auf Ihrem Mobilgerät können Sie einen Kurs (in diesem Fall Python) auswählen, um auf sehr objektive Weise zusammen mit Theorie und Fragen zu lernen, um ihn zu vertiefen. So können Sie überall lernen, während Sie im Bett sitzen oder liegen. Diese Anwendung verfügt über mehrere Optionen, die Ihnen Spaß machen werden. Darüber hinaus kann es auch eine Quelle der Beratung sein, wenn Sie Fragen haben. Ihre Community ist aktiv und Sie können sie mit der von Ihnen bevorzugten Sprache herausfordern. Als ob all das nicht genug wäre, erhalten Sie nach Abschluss des Kurses ein digitales Zertifikat, das dies unterstützt. Toll. Wenn Sie sich auf Ihrem Computer befinden, werde ich diesen Link mit Ihnen teilen, falls Sie sich vertraut machen möchten:",
        "p20":"Wenn Sie all das tun, können Sie Profile auf verschiedenen Websites erstellen, auf denen Sie Fragen stellen, eine Postleitzahl eingeben oder sich in dieser Welt bekannt machen können:",
        "p21":"Hier können Sie Ihre spezifischen Fragen stellen, für die Sie einige Muster befolgen müssen, die Sie lernen werden, wenn Sie Ihr Profil erstellen und den Anweisungen auf der Seite folgen.",
        "p22":"Sie können den gesamten gewünschten Code und vieles mehr hochladen. Meiner Meinung nach ist es unerlässlich, dass Sie hier ein Konto für alle Vorteile haben, die es Ihnen bieten kann.",
        "p23":"Ich wünschte, es gäbe eine Website, die unter Berücksichtigung Ihres Codes und anderer Variablen ein Ranking erstellt und Ihre Aktivität grafisch darstellt, damit sie leicht angezeigt werden kann ... sie existiert und ist fabelhaft.",
        "p24":"Da wir hier sind, warum nicht ein Jobprofil mit allen Gesetzen erstellen? Sie werden mir zustimmen, dass es keinen besseren Ort als diesen gibt. Es ist unbedingt erforderlich, dass Sie sich auf diese Weise bekannt machen. Die Personalvermittler prüfen ständig, wer talentiert ist, und ziehen sie möglicherweise für den idealen Job an.",
        "p25":"Denken Sie, Sie haben Wissen erworben und möchten sich selbst herausfordern? Nun, es ist Zeit für den Säuretest. Ich werde eine Seite mit Ihnen teilen, von der ich süchtig bin: ",
        "p26":"Darin können Sie auf unterhaltsame und dynamische Weise in den verfügbaren Sprachen üben, mit vielen Dateneingaben, um Ihren Code ordnungsgemäß zu testen, und als ob dies nicht ausreichen würde, wenn Sie sich bereit fühlen, können Sie Prüfungen ablegen, um Ihr Wissen zu zertifizieren und Diplome zu erhalten. Ehrlich gesagt habe ich nichts Besseres gefunden.",
        "p27":"Wenn Sie sich ein wenig mit der RGB-Farbe langweilen (25, 169, 77), schlage ich eine weitere Seite vor, auf der Sie Ihre Fähigkeiten üben können:",
        "p28":"Ehre Sensei, lass uns Katas üben!",
        "p29":"Aufmuntern, sobald diese Reise begonnen hat, wird nichts mehr so ​​sein wie zuvor.",
        "p30":"Wenn Sie früh anfangen, können Sie sich den Aufgaben stellen, die als Verbündeter ein mächtiges Werkzeug sind. Wenn Sie in einem ähnlichen Alter wie ich beginnen, können die Probleme ausgeführt werden, die Sie nicht lösen konnten und die Sie nachts quälten.",
        "p31":"Jetzt erwähne ich einige Programme, die ich gemacht habe, als ich anfing, meine Bedenken zu befriedigen:",
        "p32":"Mein Lieblingssport ist Fußball und das erste Programm, das ich ernsthaft gemacht habe, war ein Fußball-WM-Simulator. Ich habe noch keine Wahrscheinlichkeiten hinzugefügt, da im Moment alle Ergebnisse zufällig sind, aber es war zufriedenstellend, als ich es beendet habe. Auf",
        "p33":"beantworteten sie meine speziellen Fragen und so lernte ich - indem ich es tat. Viel Spaß mit dem Code hier:",
        "p34":"Ich habe einmal an einem Ort gearbeitet, an dem Waren transportiert wurden. Diese Waren kamen in Containern. Ich erinnere mich, dass meine Kollegen und ich lächerlich viel Zeit damit verbracht haben, nach Informationen über einen bestimmten Container in einer Microsoft Excel-Tabelle zu suchen, die jede Menge Informationen enthielt. Einen Code zur Optimierung der Suche finden Sie hier:",
        "p35":"Eines Tages sprach ich mit einem Freund und um eine Entscheidung zu treffen, beschlossen wir, Stein-Papier-Schere zu spielen. Ich habe verloren und musste den Job machen. Er prahlte damit, dass er nie verloren habe, weil er meine Gefühle gelesen habe. Ich ging zurück zu meinem Haus und am nächsten Tag ging ich zu ihm. Schauen Sie, was ich Ihnen hier gezeigt habe:",
        "p36":"Unglaublich wahr?",
        "p37":"Wie alle Anfänge am Anfang wird es langsam sein, etwas Neues zu lernen. In kürzester Zeit werden Sie jedoch über all das lachen.",
        "p38":"Damit…",
        "p39":"Sind Sie bereit für die besten Ratschläge zum Erlernen nicht nur des Programmierens, sondern irgendetwas in diesem Leben?",
        "p40":"Gib niemals auf. Hören Sie niemals jemandem zu, der Ihnen sagt, dass Sie Ihre Zeit verschwenden, dass Sie sehr jung sind oder dass Sie sehr alt sind. Umgib dich mit Freunden, die den gleichen Geschmack haben. Fragen Sie sich Probleme und ihre Art, sie zu lösen. Übe und erinnere dich. Das Beste kommt noch!",
        "p41":"PS: Hier sind andere Bücher, die Sie konsultieren können, wenn Sie sie für relevant halten:",
        "p42":"Machen Sie sich an die Arbeit, umgeben Sie sich mit Python, nutzen Sie das Internet, sprechen Sie, hören Sie zu, üben Sie und haben Sie vor allem Spaß."
        
    }
}