{
    "inicio":{
        "p1":"enhorabuena",
        "p2":"Vou compartilhar imediatamente com você uma das maneiras possíveis de aprender uma linguagem de programação.",
        "p3":"Vou falar com você por experiência própria e espero que seja útil para você.",
        "p4":"Um curso remunerado ou um diploma universitário são boas opções, MAS se você ainda não decidiu ou não é do seu interesse no momento as informações que apresento serão as mais atraentes.",
        "p5":"Aqui você encontrará livros, sites, dicas, exemplos de código. Tudo de forma organizada para que você decida o que fazer e como.",
        "p6":"Se eu posso, confie em mim, você também pode. Você pode até melhorar o caminho e apontá-lo para aqueles que vierem depois de você.",
        "p7":"Talvez um dia você resolva algo assim e veja que a magia existe:"
    },
    "navBar":{
        "p1":"Começar",
        "p2":"Contate-me"
    },
    "footer":{
        "p1":"Outubro"
    },
    "page404":{
        "p1":"404 - Nao encontrado! ",
        "p2":" não existe... ",
        "p3":"Começar"
    },
    "contacto":{
        "p1":"Anime-se!",
        "p2":"Qualquer motivo é bom para conversar, compartilhar conhecimentos e ficar em contato.",
        "p3":"teu nome",
        "p4":"conte-me sua história ",
        "p5":"Enviar",
        "p6":"email@exemplo.com"
    },
    "mapView":{
        "p1":"Oi! "

    },
    "buttonTop":{
        "p1":"acima "

    },
    "metaTags":{
        "p1":"Principais sites para aprender Python e JavaScript. Livros Dicas. Exemplos de código."
    },
    "paypalButton":{
        "p1":"me convide para um café."
    },
    "myHistoryJS":{
        "p1":"minha história com JavaScript",
        "p2":"Você achou que a viagem ia acabar aí, certo?",
        "p3":"O ser humano, para o bem ou para o mal, está bastante insatisfeito e sempre quer mais.",
        "p4":"Fiquei curioso ... Certamente acredito que nada é impossível com um pouco de dedicação e o aprendizado sempre vai ser mais rápido do que quando eu não tinha ideia nenhuma.",
        "p5":"Então, após 7 meses com Python, comecei a aprender JavaScript (HTML e CSS também) porque me sentia atraído pelo desenvolvimento web, especificamente a parte conhecida como Front-End. Além disso, o Javascript também é considerado uma linguagem de programação menos complicada do que outras. É que com apenas o navegador da web instalado em seu computador você pode fazer coisas no console que está integrado. Uma maravilha.",
        "p6":"Digo que, embora você possa escolher o programa que deseja para o preenchimento automático e revisão do seu código, há uma forte tendência entre meus conhecidos do Visual Studio Code. Já estou percebendo o porquê. Instale-o aqui:",
        "p7":"Hoje o Javascript é uma das linguagens mais populares do mundo e é usado para adicionar interatividade a páginas da web, processar dados, bem como criar diferentes tipos de aplicativos (aplicativos móveis, aplicativos de desktop, jogos, etc.)",
        "p8":"Tendo perfis nos sites mencionados em minha outra história, dediquei-me a fazer perguntas e reunir informações para estudar. Ressalto que sempre acesso o aplicativo móvel SoloLearn para ter uma primeira abordagem ao idioma e automaticamente depois uso o ",
        "p9":"para estudar e praticar. O exposto, junto com os livros que compartilharei com vocês imediatamente, considero uma mistura dos mais interessantes.",
        "p10":"Para não perder o hábito, mostro aqui alguns programas que fiz no início:",
        "p11":"Em algum momento comecei a conversar com minha esposa sobre os signos do zodíaco e não tinha nenhuma fonte de informação à mão para esclarecer alguns detalhes com as datas etc. Portanto, a primeira coisa que fiz seriamente nesta linguagem foi o seguinte:",
        "p12":"Um dia, eu estava esperando para entrar em um restaurante, quando me ocorreu tentar simular a fila. Aqui eu mostro para você:",
        "p13":"No meu antigo trabalho era necessário, dadas as coordenadas de estacionamento e orientação de um teodolito, ser capaz de calcular o ângulo de implantação e a distância de um terceiro ponto. Resolvi assim:",
        "p14":"Bem, é nisso que estou atualmente. Estou estudando uma biblioteca JavaScript conhecida como React.js. Com ela estou fazendo esse tipo de blog onde vou mostrar o caminho que tenho seguido e também me dar a conhecer nesta área. Acho que essa informação pode ser útil simplesmente porque gostaria de ter encontrado algo semelhante quando comecei.",
        "p15":"Com tempo e prática, espero ser capaz de criar páginas da web dinâmicas e interessantes. Sempre um passo de cada vez, que nada mais bonito do que um dia após o outro. Este é apenas o começo.",
        "p16":"É neste ponto que compartilho com vocês o melhor site para aprender não apenas HTML5, CCS3 e JavaScript, mas também Python e muito mais:",
        "p17":"Se você quer aprender Javascript e, portanto, desenvolvimento web, tenho certeza de que não verá seu navegador da mesma forma.",
        "p18":"Vejo você nas redes."
    },
    "myHistoryPython":{
        "p1":"minha história com Python",
        "p2":"Em outubro de 2019, minha jornada no mundo da programação começou.",
        "p3":"A sério!?",
        "p4":"Não seria justo se eu dissesse o que precede.",
        "p5":"Sempre fui fascinado por programação, mas não pela determinação atual. Na pré-faculdade eu estava dando meus primeiros passos com o “MSX-Basic”, em 1995, mas era tudo.",
        "p6":"O tempo foi passando e embora eu estivesse ansioso para trabalhar no computador, minhas opções de trabalho só convergiam para uma planilha do Microsoft Excel quando eu ia enfrentar algum problema extra.",
        "p7":"Não sabia programar em nenhuma linguagem (ainda: P), mas tinha certeza de que ter essa habilidade poderia ser útil quando fosse enfrentar um problema, para facilitar uma atividade de trabalho, etc.",
        "p8":"Sempre fui perseguido pela ideia de que poderia automatizar minhas atividades, mas o que fazer ..., aos 38 anos, sem muito tempo para estudar, surge o seguinte questionamento:",
        "p9":"Qual linguagem de programação tem uma curva de aprendizado suave e pode ser usada para muitas atividades?",
        "p10":"Pode haver outros, mas Python mudou minha vida.",
        "p11":"Python é uma linguagem de programação de alto nível, com aplicativos em diversas áreas, incluindo desenvolvimento da web, scripts, computação científica e inteligência artificial.",
        "p12":"Não vou me deter no interior dela, mas vou compartilhar com vocês tudo o que me nutri para mergulhar nessa linguagem, arranjada cronologicamente. Então darei a você o melhor conselho para aprendê-lo.",
        "p13":"A primeira coisa é instalar o Python, a partir da página oficial:",
        "p14":"A segunda coisa é procurar um programa que nos ajude com o autocompletar de código, sugestões e outras facilidades. No curso do youtube que irei sugerir para você no ponto número 4, a professora escolheu Texto Sublime 3. Recomendo o mesmo, embora mais tarde você encontre outros que podem ser do seu interesse. Você pode baixá-lo aqui:",
        "p15":"Como o nome indica, este livro é para iniciantes e é bem acompanhado de exemplos simples. Você deve ter em mente que este livro é sobre Python 2 e algumas mudanças de sintaxe em relação à versão que você certamente irá instalar (Python 3), então haverá diferenças, por exemplo print 2 + 3 vs print (2 + 3), etc. . Mas por que apontar manchas ao sol :)",
        "p16":"Curso do Youtube Píldras Informáticas. O Professor Juan Díaz levará você pela mão em uma jornada requintada onde a pedagogia e a didática irão moldar o programador em você. Depois deste curso você certamente poderá criar seus primeiros programas, dos quais sempre se orgulhará. Visite-o e veja o que você acha:",
        "p17":"Site",
        "p18":"O professor Juan José Lozano Gómez lhe dará um vislumbre da programação mais contextualizada à realidade. Ele irá mostrar diferentes estruturas para realizar diferentes atividades. Você perceberá que o próprio Python é apenas o começo e que isso só poderia ficar melhor. Então torne-se um pythonist mestre.",
        "p19":"Aplicativo móvel: SoloLearn. Este aplicativo em seu dispositivo móvel permitirá que você escolha um curso (Python neste caso) para aprender de forma bem objetiva junto com a teoria e questões para reforçá-la. Assim, você pode estudar em qualquer lugar enquanto descansa sentado ou deitado na cama. Este aplicativo possui várias opções que você achará divertidas. Além disso, também pode ser uma fonte de consulta quando você tiver alguma dúvida. A comunidade deles é ativa e você pode desafiá-los usando o idioma de sua preferência. Como se tudo isso não bastasse, assim que o curso for concluído você obtém um certificado digital que o suporta. Ótimo. Se você estiver em seu computador, compartilharei este link com você, caso queira se familiarizar: ",
        "p20":"No que você faz todas as opções acima, por que não criar perfis em diferentes sites onde você pode fazer perguntas, postar códigos ou se tornar conhecido neste mundo:",
        "p21":"Aqui você pode fazer suas perguntas específicas, para as quais você deve seguir alguns padrões que você aprenderá assim que criar seu perfil e seguir as instruções na página.",
        "p22":"Você poderá enviar todo o código que desejar e muito mais. Em minha opinião, é fundamental que você tenha uma conta aqui para todas as vantagens que ela pode oferecer.",
        "p23":"Gostaria que houvesse um site que, levando em conta o seu código e outras variáveis, fizesse um ranking e representasse um gráfico de sua atividade para que pudesse ser facilmente visualizado ... existe e é fabuloso.",
        "p24":"Já que estamos aqui, porque não fazer um perfil de trabalho com toda a legislação. Você vai concordar comigo que não há lugar melhor do que este. É imperativo que você se dê a conhecer dessa forma. Os recrutadores verificam constantemente quem é talentoso e, assim, talvez os atraiam para o emprego ideal.",
        "p25":"Você acha que adquiriu conhecimentos e quer se desafiar? Bem, é hora do teste de ácido. Vou compartilhar com vocês uma página na qual sou viciado:",
        "p26":"Nele você poderá praticar nas linguagens que tem disponíveis de forma lúdica e dinâmica, com muitas entradas de dados para testar devidamente o seu código e como se não bastasse quando se sentir pronto pode fazer exames para certificar os seus conhecimentos e obter diplomas. Honestamente, não encontrei nada melhor.",
        "p27":"Para quando você ficar um pouco entediado com a cor rgb (25, 169, 77), proponho outra página onde você pode praticar suas habilidades:",
        "p28":"Honra Sensei, vamos praticar katas!",
        "p29":"Anime-se, uma vez iniciada esta viagem, nada será como antes.",
        "p30":" você começar cedo poderá enfrentar as tarefas tendo como aliada uma ferramenta poderosa. Se você começar com uma idade semelhante à minha, então aqueles problemas que você não conseguiu resolver e que o atormentavam à noite podem ser executados.",
        "p31":"Agora menciono alguns programas que fiz quando comecei a satisfazer minhas preocupações:",
        "p32":"Meu esporte favorito é futebol e bem, o primeiro programa que fiz a sério foi um simulador de Copa do Mundo, ainda não adicionei probabilidades porque agora todos os resultados são aleatórios, mas foi satisfatório quando terminei. Em",
        "p33":"eles responderam às minhas perguntas específicas e é assim que eu estava aprendendo - fazendo - fazendo. Divirta-se com o código aqui:",
        "p34":"Certa vez, trabalhei em um local para transporte de mercadorias. Essas mercadorias vieram em contêineres. Lembro-me de que meus colegas e eu passamos uma quantidade absurda de tempo procurando informações sobre um determinado contêiner em uma planilha do Microsoft Excel que tinha toneladas de informações. Você pode encontrar um código para otimizar a pesquisa aqui:",
        "p35":"Um dia estava conversando com um amigo e para tomar uma decisão resolvemos jogar pedra - papel - tesoura. Eu perdi e tive que fazer o trabalho. Ele se gabou de que nunca perdeu porque leu minhas emoções. Voltei para minha casa e no dia seguinte fui vê-lo. Olha o que te mostrei aqui:",
        "p36":"Incrível, verdade?",
        "p37":"Como todo começo, aprender algo novo será lento. Porém, em nenhum momento você estará rindo de tudo isso.",
        "p38":"Então…",
        "p39":"Você está pronto para receber os melhores conselhos sobre o aprendizado não apenas de programação, mas de qualquer coisa nesta vida?",
        "p40":"Nunca desista. Nunca dê ouvidos a alguém que lhe diz que você está perdendo tempo, ou que é muito jovem, ou que é muito velho. Cerque-se de amigos que compartilham os mesmos gostos. Pergunte a si mesmo os problemas e sua maneira de resolvê-los. Pratique e lembre-se. O melhor está por vir!",
        "p41":"PS: Aqui estão outros livros que você pode consultar quando achar relevante:",
        "p42":"Comece a trabalhar, rodeie-se de Python, use a internet, converse, ouça, pratique e acima de tudo divirta-se."
        
    }


}