{
    "inicio":{
        "p1":"congratulazioni",
        "p2":"Condividerò immediatamente con voi uno dei possibili modi in cui puoi imparare un linguaggio di programmazione.",
        "p3":"Ti parlerò della mia esperienza e spero che ti sarà utile.",
        "p4":"Un corso a pagamento o una laurea sono opzioni super valide MA se non hai ancora deciso o non è di tuo interesse al momento le informazioni che presento saranno le più allettanti.",
        "p5":"Qui troverai libri, siti Web, suggerimenti, esempi di codice. Tutto in modo organizzato in modo da poter decidere cosa fare e come.",
        "p6":"Se posso, credimi, puoi farlo anche tu. Puoi persino migliorare il percorso e segnalarlo a coloro che verranno dopo di te.",
        "p7":"Forse un giorno risolverai qualcosa del genere e vedrai che la magia esiste:"
    },
    "navBar":{
        "p1":"Inizio",
        "p2":"Contattami"
    },
    "footer":{
        "p1":"Ottobre "
    },
    "page404":{
        "p1":"404 - Non trovato! ",
        "p2":" non esiste... ",
        "p3":"Inizio"
    },
    "contacto":{
        "p1":"Tirati su!",
        "p2":"Qualsiasi motivo è utile per parlare, condividere conoscenze e rimanere in contatto.",
        "p3":"il tuo nome",
        "p4":"raccontami la tua storia ...",
        "p5":"Spedire",
        "p6":"email@esempio.com"


    },
    "mapView":{
        "p1":"Ciao! "

    },
    "buttonTop":{
        "p1":"su "

    },
    "metaTags":{
        "p1":"I migliori siti web per imparare Python e JavaScript. Libri. Suggerimenti. Esempi di codice. "

    },
    "paypalButton":{
        "p1":"invitami a un caffè."
    },
    "myHistoryJS":{
        "p1":"la mia storia con JavaScript",
        "p2":"Pensavi che il viaggio sarebbe finito qui, vero?",
        "p3":"L'essere umano, nel bene e nel male, è abbastanza insoddisfatto e vuole sempre di più.",
        "p4":"Ero curioso ... credo che niente sia impossibile con un po 'di dedizione e l'apprendimento sarà sempre più veloce comunque di quando non ne avevo idea.",
        "p5":"Così, dopo 7 mesi con Python, ho iniziato a imparare JavaScript (anche HTML e CSS) perché ero attratto dallo sviluppo web, in particolare la parte nota come Front-End. Oltre a ciò, Javascript è anche considerato un linguaggio di programmazione meno complicato di altri. È che con solo il browser web installato sul tuo computer puoi fare cose nella console che è integrata. Una meraviglia.",
        "p6":"Ti dico che, sebbene tu possa scegliere il programma che desideri per il completamento automatico e la revisione del tuo codice, c'è una forte tendenza tra i miei conoscenti di Visual Studio Code. Capisco già perché. Installalo da qui:",
        "p7":"Oggi Javascript è uno dei linguaggi più diffusi al mondo e viene utilizzato per aggiungere interattività alle pagine web, elaborare dati, nonché creare diversi tipi di applicazioni (applicazioni mobili, applicazioni desktop, giochi, ecc.)",
        "p8":"Avendo profili sui siti web citati nell'altra mia storia, mi sono dedicato a porre domande e raccogliere informazioni da studiare. Sottolineo che accedo sempre all'applicazione mobile SoloLearn per avere il primo approccio alla lingua e in seguito utilizzo automaticamente ",
        "p9":"per studiarla e praticarla. Quanto sopra, insieme ai libri che condividerò subito con voi, lo considero un misto tra i più interessanti.",
        "p10":"Per non perdere l'abitudine, qui vi mostro alcuni programmi che ho realizzato all'inizio:",
        "p11":"Ad un certo punto inizio a parlare con mia moglie dei segni zodiacali e non avevo nessuna fonte di informazione a portata di mano per chiarire certi dettagli con le date ecc. Quindi la prima cosa che ho fatto seriamente in questa lingua è stata la seguente:",
        "p12":"Un giorno stavo aspettando di entrare in un ristorante quando mi venne in mente di provare a simulare la fila. Qui ti mostro:",
        "p13":"Nel mio vecchio lavoro era necessario, date le coordinate di parcheggio e l'orientamento di un teodolite, poter calcolare l'angolo di tracciamento e la distanza di un terzo punto. L'ho risolto in questo modo:",
        "p14":"Bene, questo è quello che sto facendo attualmente. Sto studiando una libreria JavaScript nota come React.js. Con lei sto realizzando questo tipo di blog dove vi mostro il percorso che ho seguito e mi faccio conoscere anche in questo settore. Penso che questa informazione possa essere utile semplicemente perché vorrei aver trovato qualcosa di simile quando ho iniziato.",
        "p15":"Con il tempo e la pratica spero di riuscire a realizzare pagine web dinamiche e interessanti. Sempre un passo alla volta, che non c'è niente di più bello di un giorno dopo l'altro. Questo è solo l'inizio.",
        "p16":"È a questo punto che condivido con voi il miglior sito web per imparare non solo HTML5, CCS3 e JavaScript ma anche Python e molto altro:",
        "p17":"Se vuoi imparare Javascript, e quindi sviluppo web, sono sicuro che non vedrai il tuo browser nello stesso modo.",
        "p18":"Ci vediamo sulle reti."
    },
    "myHistoryPython":{
        "p1":"la mia storia con Python",
        "p2":"Nell'ottobre 2019 è iniziato il mio viaggio nel mondo della programmazione.",
        "p3":"Veramente!?",
        "p4":"Non sarebbe giusto se dicessi quanto sopra.",
        "p5":"Sono sempre stato affascinato dalla programmazione ma non dalla determinazione attuale. In pre-università stavo muovendo i primi passi con MSX-Basic, nel 1995, ma era tutto.",
        "p6":"Il tempo passava e anche se ero ansioso di lavorare al computer, le mie opzioni di lavoro convergevano su un foglio di calcolo in Microsoft Excel solo quando stavo per affrontare qualche problema in più.",
        "p7":"Non sapevo programmare in nessuna lingua (ancora: P) ma ero sicuro che avere questa abilità potesse essere utile quando avrei dovuto affrontare un problema, per rendere più facile un'attività lavorativa, ecc.",
        "p8":"Da sempre l'idea di poter automatizzare le mie attività mi perseguitava ma cosa fare ..., a 38 anni, senza molto tempo per studiare, sorge la seguente domanda:",
        "p9":"Quale linguaggio di programmazione ha una curva di apprendimento dolce e può essere utilizzato per molte attività?",
        "p10":"Potrebbero essercene altri, ma Python ha cambiato la mia vita.",
        "p11":"Python è un linguaggio di programmazione di alto livello, con applicazioni in numerose aree tra cui sviluppo web, scripting, calcolo scientifico e intelligenza artificiale.",
        "p12":"Non mi soffermerò sul suo interno, ma condividerò con voi tutto ciò di cui mi sono nutrito per immergermi in questo linguaggio, ordinato cronologicamente. Allora ti darò i migliori consigli per impararlo.",
        "p13":"La prima cosa è installare Python, dalla pagina ufficiale:",
        "p14":"La seconda cosa è cercare un programma che ci aiuti con il completamento automatico del codice, suggerimenti e altri servizi. Nel corso youtube che ti suggerisco al punto 4, l'insegnante ha scelto Sublime Text 3. Consiglio lo stesso, anche se in seguito ne troverai altri che potrebbero interessarti. Puoi scaricarlo qui:",
        "p15":"Come suggerisce il nome, questo libro è per principianti, è ben strutturato con semplici esempi. Tieni presente che questo libro riguarda Python 2 e alcune modifiche alla sintassi rispetto alla versione che installerai sicuramente (Python 3) quindi ci saranno differenze, ad esempio print 2 + 3 vs print (2 + 3), ecc. . Ma perché segnalare macchie al sole :)",
        "p16":"Corso Youtube Píldoras Informáticas. Il professor Juan Díaz ti accompagnerà per mano in un viaggio squisito in cui pedagogia e didattica daranno forma al programmatore che è in te. Dopo questo corso sarai sicuramente in grado di creare i tuoi primi programmi, di cui sarai sempre orgoglioso. Visitatelo e vedete cosa ne pensate:",
        "p17":"Sito web",
        "p18":"Il professor Juan José Lozano Gómez ti darà uno sguardo alla programmazione più contestualizzata alla realtà. Ti mostrerà diversi framework per eseguire diverse attività. Ti renderai conto che Python stesso è solo l'inizio e che potrebbe solo migliorare. Quindi diventa un maestro pitonista.",
        "p19":"Applicazione mobile: SoloLearn. Questa applicazione sul tuo dispositivo mobile ti permetterà di scegliere un corso (Python in questo caso) per apprendere in modo molto obiettivo insieme a teoria e domande per rafforzarlo. Quindi puoi studiare ovunque mentre riposi seduto o sdraiato sul letto. Questa applicazione ha diverse opzioni che troverai divertenti. Inoltre, può anche essere una fonte di consultazione in caso di domande. La loro comunità è attiva e puoi sfidarli usando la lingua che preferisci. Come se tutto quanto sopra non bastasse, una volta completato il corso si ottiene un certificato digitale che lo supporti. Grande. Se sei sul tuo computer, condividerò questo link con te nel caso tu voglia familiarizzare: ",
        "p20":"In quello che fai tutto quanto sopra, perché non creare profili su diversi siti Web dove puoi porre domande, inserire codice o farti conoscere in questo mondo:",
        "p21":"Qui puoi porre le tue domande specifiche, per le quali devi seguire alcuni schemi che imparerai una volta creato il tuo profilo e seguito le istruzioni sulla pagina.",
        "p22":"Potrai caricare tutto il codice che desideri e molto altro ancora. Secondo me è imperativo che tu abbia un account qui per tutti i vantaggi che può offrirti.",
        "p23":"Vorrei che ci fosse un sito web che, tenendo conto del tuo codice e di altre variabili, creasse una classifica e rappresentasse graficamente la tua attività in modo che possa essere facilmente visualizzata ... esiste ed è favoloso.",
        "p24":"Dato che siamo qui, perché non fare un profilo di lavoro con tutta la legge. Sarai d'accordo con me sul fatto che non c'è posto migliore di questo. È imperativo che tu ti faccia conoscere in questo modo. I reclutatori controllano costantemente chi ha talento e quindi li attira, forse, per il lavoro ideale.",
        "p25":"Pensi di aver acquisito conoscenze e di voler metterti alla prova? Bene, è il momento della prova del fuoco. Condividerò con voi una pagina di cui sono dipendente:",
        "p26":"In esso potrai esercitarti nelle lingue che ha a disposizione in modo divertente e dinamico, con tanti input di dati per testare correttamente il tuo codice e come se non bastasse quando ti sentirai pronto potrai sostenere esami per certificare le tue conoscenze e ottenere diplomi. Onestamente, non ho trovato niente di meglio.",
        "p27":"Per quando ti annoi un po 'con i colori rgb (25, 169, 77) ti propongo un'altra pagina dove puoi esercitare le tue abilità:",
        "p28":"Onore Sensei, facciamo pratica con i kata!",
        "p29":"Coraggio, una volta iniziato questo viaggio, niente sarà più come prima.",
        "p30":"Se inizi presto sarai in grado di affrontare i compiti avendo come alleato uno strumento potente. Se inizi in un'età simile alla mia allora quei problemi che non eri riuscito a risolvere e che ti tormentavano di notte possono essere eseguiti.",
        "p31":"Ora cito alcuni programmi che ho fatto quando ho iniziato a soddisfare le mie preoccupazioni:",
        "p32":"Il mio sport preferito è il calcio e beh, il primo programma che ho fatto seriamente è stato un simulatore di Mondiali di calcio, devo ancora aggiungere le probabilità perché in questo momento tutti i risultati sono casuali ma è stato soddisfacente quando l'ho finito. In",
        "p33":"hanno risposto alle mie particolari domande ed è così che stavo imparando - facendo -. Divertiti con il codice qui:",
        "p34":"Una volta ho lavorato in un luogo in cui venivano trasportate merci. Queste merci sono arrivate in container. Ricordo che i miei colleghi e io abbiamo trascorso una quantità ridicola di tempo alla ricerca di informazioni su un determinato contenitore in un foglio Microsoft Excel che conteneva tonnellate di informazioni. Puoi trovare un codice per ottimizzare la ricerca qui:",
        "p35":"Un giorno stavo parlando con un amico e per prendere una decisione abbiamo deciso di giocare a sasso - carta - forbici. Ho perso e ho dovuto fare il lavoro. Si vantava di non aver mai perso perché leggeva le mie emozioni. Sono tornato a casa mia e il giorno dopo sono andato a trovarlo. Guarda cosa ti ho mostrato qui:",
        "p36":"Incredibile vero?",
        "p37":"Come tutti gli inizi, imparare qualcosa di nuovo all'inizio sarà lento. Tuttavia, in men che non si dica riderai di tutto questo.",
        "p38":"Così…",
        "p39":"Sei pronto per i migliori consigli su come imparare non solo la programmazione, ma qualsiasi cosa in questa vita?",
        "p40":"Non mollare mai. Non ascoltare mai qualcuno che ti dice che stai sprecando il tuo tempo, o che sei molto giovane o che sei molto vecchio. Circondati di amici che condividono gli stessi gusti. Chiediti i problemi e il loro modo di risolverli. Fai pratica e ricorda. Il meglio deve ancora venire!",
        "p41":"PS: ecco altri libri che puoi consultare quando lo trovi pertinente:",
        "p42":"Mettiti al lavoro, circondati di Python, usa internet, parla, ascolta, esercitati e soprattutto divertiti."
        
    }

}