{
    "inicio":{
        "p1":"toutes nos félicitations",
        "p2":"Je vais immédiatement partager avec vous l'une des manières possibles de vous pouvez apprendre un langage de programmation.",
        "p3":"Je vais vous parler de mon expérience et j'espère que cela vous sera utile.",
        "p4":"Un cours payant ou un diplôme universitaire sont des options super valables MAIS si vous n'avez pas encore décidé ou si cela ne vous intéresse pas pour le moment, les informations que je présenterai seront les plus intéressantes.",
        "p5":"Vous trouverez ici des livres, des sites Web, des astuces, des exemples de code. Tout de manière organisée pour que vous puissiez décider quoi faire et comment.",
        "p6":"Si je peux, croyez-moi, vous pouvez aussi. Vous pouvez même améliorer le chemin et le signaler à ceux qui vous suivent.",
        "p7":"Peut-être qu'un jour vous résoudrez quelque chose comme ça et vous verrez que la magie existe:"
    },
    "navBar":{
        "p1":"Commencer",
        "p2":"Contactez-moi"
    },
    "footer":{
        "p1":"Octobre "
    },
    "page404":{
        "p1":"404 - Pas trouvé! ",
        "p2":" n'existe pas... ",
        "p3":"Commencer"
    },
    "contacto":{
        "p1":"Courage! ",
        "p2":"Toute raison est bonne pour parler, partager des connaissances et rester en contact.",
        "p3":"ton nom",
        "p4":"raconte-moi ton histoire ...",
        "p5":"Envoyer",
        "p6":"email@exemple.com"
    },
    "mapView":{
        "p1":"Salut! "

    },
    "buttonTop":{
        "p1":"vers le haut "

    },
    "metaTags":{
        "p1":"Meilleurs sites Web pour apprendre Python et JavaScript. Livres. Conseils. Exemples de code. "

    },
    "paypalButton":{
        "p1":"invitez-moi à prendre un café."
    },
    "myHistoryJS":{
        "p1":"mon histoire avec JavaScript",
        "p2":"Vous pensiez que le voyage se terminerait là, non?",
        "p3":"L'être humain, pour le meilleur ou pour le pire, est assez mécontent et en veut toujours plus.",
        "p4":"J'étais curieux… Je crois certainement que rien n'est impossible avec un peu de dévouement et l'apprentissage va toujours être plus rapide de toute façon que quand je n'avais aucune idée du tout.",
        "p5":"C'est donc qu'après 7 mois avec Python, j'ai commencé à apprendre JavaScript (HTML et CSS également) parce que j'étais attiré par le développement Web, en particulier la partie connue sous le nom de Front-End. En plus de cela, Javascript est également considéré comme un langage de programmation moins compliqué que d'autres. C'est qu'en ayant seulement le navigateur Web installé sur votre ordinateur, vous pouvez faire des choses dans la console qui est intégrée. Une merveille.",
        "p6":"Je vous dis que, bien que vous puissiez choisir le programme que vous souhaitez pour l'autocomplétion et la révision de votre code, il y a une forte tendance parmi mes connaissances de Visual Studio Code. Je comprends déjà pourquoi. Installez-le ici:",
        "p7":"Aujourd'hui, Javascript est l'un des langages les plus populaires au monde et est utilisé pour ajouter de l'interactivité aux pages Web, traiter les données, ainsi que créer différents types d'applications (applications mobiles, applications de bureau, jeux, etc.)",
        "p8":"Ayant des profils sur les sites Web mentionnés dans mon autre histoire, je me suis consacré à poser des questions et à recueillir des informations pour étudier. Je souligne que j'accède toujours à l'application mobile SoloLearn pour avoir la première approche de la langue et qu'ensuite j'utilise automatiquement",
        "p9":"pour l'étudier et la pratiquer. Ce qui précède, ainsi que les livres que je vais partager avec vous immédiatement, je considère un mélange des plus intéressants.",
        "p10":"Afin de ne pas perdre l'habitude, je vous montre ici quelques programmes que j'ai réalisés au début",
        "p11":"À un moment donné, je commence à parler avec ma femme des signes du zodiaque et je n'avais aucune source d'informations à portée de main pour clarifier certains détails avec les dates, etc. Donc, la première chose que j'ai faite sérieusement dans cette langue a été la suivante:",
        "p12":"Un jour, j'attendais d'entrer dans un restaurant quand il m'est venu à l'esprit d'essayer de simuler la ligne. Ici, je vous montre:",
        "p13":"Dans mon ancien travail, il était nécessaire, compte tenu des coordonnées de stationnement et de l'orientation d'un théodolite, de pouvoir calculer l'angle d'implantation et la distance d'un troisième point. Je l'ai résolu de cette façon:",
        "p14":"Eh bien, c'est ce que je fais actuellement. J'étudie une bibliothèque JavaScript appelée React.js. Avec elle je fais ce genre de blog où je vous montre le chemin que j'ai suivi et je me fais également connaître dans ce domaine. Je pense que ces informations peuvent être utiles simplement parce que j'aurais aimé trouver quelque chose de similaire lorsque j'ai commencé.",
        "p15":"Avec le temps et la pratique, j'espère être en mesure de créer des pages Web dynamiques et intéressantes. Toujours un pas à la fois, qu'il n'y a rien de plus beau qu'un jour après l'autre. Ce n'est que le début.",
        "p16":"C'est à ce stade que je partage avec vous le meilleur site Web pour apprendre non seulement HTML5, CCS3 et JavaScript mais aussi Python et bien plus encore:",
        "p17":"Si vous voulez apprendre Javascript, et donc le développement web, je suis sûr que vous ne verrez pas votre navigateur web de la même manière.",
        "p18":"Rendez-vous sur les réseaux."
    },
    "myHistoryPython":{
        "p1":"mon histoire avec Python",
        "p2":"En octobre 2019, mon voyage dans le monde de la programmation a commencé.",
        "p3":"Vraiment!?",
        "p4":"Ce ne serait pas juste si je disais ce qui précède.",
        "p5":"J'ai toujours été fasciné par la programmation mais pas par la détermination actuelle. À la pré-université, je faisais mes premiers pas avec «MSX-Basic», en 1995, mais c'était tout.",
        "p6":"Le temps passait et même si j'avais hâte de travailler sur l'ordinateur, mes options de travail ne convergeaient sur une feuille de calcul dans Microsoft Excel que lorsque j'allais faire face à un problème supplémentaire.",
        "p7":"Je ne savais pas programmer dans aucune langue (encore: P) mais j'étais sûr qu'avoir cette compétence pouvait être utile lorsque j'allais faire face à un problème, pour faciliter une activité de travail, etc.",
        "p8":"Toujours l'idée que je pourrais automatiser mes activités m'a hanté mais que faire ..., à 38 ans, sans trop de temps pour étudier, la question suivante se pose:",
        "p9":"Quel langage de programmation a une courbe d'apprentissage douce et peut être utilisé pour de nombreuses activités?",
        "p10":"Il y en a peut-être d'autres mais Python a changé ma vie.",
        "p11":"Python est un langage de programmation de haut niveau, avec des applications dans de nombreux domaines, notamment le développement Web, les scripts, le calcul scientifique et l'intelligence artificielle.",
        "p12":"Je ne vais pas m'attarder sur le dedans, mais je vais partager avec vous tout ce dont je me suis nourri pour m'immerger dans ce langage, organisé chronologiquement. Ensuite, je vous donnerai les meilleurs conseils pour l'apprendre.",
        "p13":"La première chose à faire est d'installer Python, depuis la page officielle:",
        "p14":"La deuxième chose est de rechercher un programme qui nous aide avec la saisie semi-automatique du code, des suggestions et d'autres fonctionnalités. Dans le cours youtube que je vais vous proposer au point 4, l'enseignant a choisi Sublime Text 3. Je recommande la même chose, bien que plus tard, vous en trouverez d'autres qui pourraient vous intéresser. Vous pouvez le télécharger ici:",
        "p15":"Comme son nom l'indique, ce livre est destiné aux débutants, il est bien rythmé avec des exemples simples. Vous devez garder à l'esprit que ce livre traite de Python 2 et de quelques changements de syntaxe par rapport à la version que vous allez sûrement installer (Python 3) donc il y aura des différences, par exemple print 2 + 3 vs print (2 + 3), etc. . Mais pourquoi signaler des endroits au soleil :)",
        "p16":"Cours Youtube Píldoras Informáticas. Le professeur Juan Díaz vous emmènera par la main dans un voyage exquis où la pédagogie et la didactique façonneront le programmeur en vous. Après ce cours, vous pourrez sûrement créer vos premiers programmes, dont vous serez toujours fier. Visitez-le et voyez ce que vous en pensez:",
        "p17":"Site Web",
        "p18":"Le professeur Juan José Lozano Gómez vous donnera un aperçu de la programmation plus contextualisée à la réalité. Il vous montrera différents cadres pour effectuer différentes activités. Vous vous rendrez compte que Python lui-même n'est que le début, et que cela ne peut que s'améliorer. Alors devenez un maître pythoniste.",
        "p19":"Application mobile: SoloLearn. Cette application sur votre appareil mobile vous permettra de choisir un cours (Python dans ce cas) pour apprendre de manière très objective avec de la théorie et des questions pour le renforcer. Ainsi, vous pouvez étudier n'importe où pendant que vous vous reposez assis ou allongé dans votre lit. Cette application dispose de plusieurs options que vous trouverez agréables. De plus, il peut également être une source de consultation lorsque vous avez des questions. Leur communauté est active et vous pouvez les défier en utilisant la langue que vous préférez. Comme si tout ce qui précède ne suffisait pas, une fois le cours terminé, vous obtenez un certificat numérique qui le prend en charge. Brillant. Si vous êtes sur votre ordinateur, je partagerai ce lien avec vous au cas où vous souhaiteriez vous familiariser:",
        "p20":"Dans ce que vous faites tout ce qui précède, pourquoi ne pas créer des profils sur différents sites Web où vous pouvez poser des questions, code postal ou vous faire connaître dans ce monde:",
        "p21":"Ici, vous pouvez poser vos questions spécifiques, pour lesquelles vous devez suivre certains modèles que vous apprendrez une fois que vous aurez créé votre profil et que vous suivrez les instructions de la page.",
        "p22":"Vous pourrez télécharger tout le code que vous voulez et bien plus encore. À mon avis, il est impératif que vous ayez un compte ici pour tous les avantages qu'il peut vous offrir.",
        "p23":"J'aurais aimé qu'il y ait un site Web qui, en tenant compte de votre code et d'autres variables, créerait un classement et un graphique de votre activité afin qu'elle puisse être facilement affichée ... elle existe et est fabuleuse.",
        "p24":"Puisque nous sommes ici, pourquoi ne pas faire un profil d'emploi avec toutes les lois. Vous conviendrez avec moi qu'il n'y a pas de meilleur endroit que celui-ci. Il est impératif que vous vous fassiez connaître de cette manière. Les recruteurs vérifient constamment pour voir qui est talentueux et ainsi les attirer, peut-être, pour le poste idéal.",
        "p25":" Pensez-vous avoir acquis des connaissances et souhaitez vous mettre au défi? Eh bien, il est temps pour le test d'acide. Je vais partager avec vous une page à laquelle je suis accro:",
        "p26":"Dans celui-ci, vous pourrez pratiquer dans les langues dont il dispose d'une manière agréable et dynamique, avec de nombreuses entrées de données pour tester correctement votre code et comme si cela ne suffisait pas lorsque vous vous sentez prêt, vous pouvez passer des examens pour certifier vos connaissances et obtenir des diplômes. Honnêtement, je n'ai rien trouvé de mieux.",
        "p27":"Pour quand vous vous ennuyez un peu avec la couleur rgb (25, 169, 77) je vous propose une autre page où vous pourrez pratiquer vos compétences:",
        "p28":"Honore sensei, pratiquons les katas!",
        "p29":"Bon courage, une fois ce voyage commencé, plus rien ne sera comme avant.",
        "p30":"Si vous commencez tôt vous pourrez faire face aux tâches ayant pour allié un outil puissant. Si vous commencez à un âge similaire au mien, alors les problèmes que vous n'aviez pas pu résoudre et qui vous tourmentaient la nuit peuvent être exécutés.",
        "p31":"Maintenant, je mentionne certains programmes que j'ai réalisés lorsque j'ai commencé à satisfaire mes préoccupations:",
        "p32":"Mon sport préféré est le football et bien, le premier programme que j'ai fait sérieusement était un simulateur de Coupe du monde de football, je n'ai pas encore ajouté de probabilités car pour le moment tous les résultats sont aléatoires mais c'était satisfaisant quand je l'ai terminé. Sur",
        "p33":"ils ont répondu à mes questions particulières et c'est ainsi que j'apprenais - en - faisant. Amusez-vous avec le code ici:",
        "p34":"J'ai déjà travaillé dans un endroit où les marchandises étaient transportées. Ces marchandises sont venues dans des conteneurs. Je me souviens que mes collègues et moi avons passé un temps ridicule à rechercher des informations sur un certain conteneur dans une feuille Microsoft Excel contenant des tonnes d'informations. Vous pouvez trouver un code pour optimiser la recherche ici:",
        "p35":" Un jour, je parlais avec un ami et pour prendre une décision, nous avons décidé de jouer du rock - papier - ciseaux. J'ai perdu et j'ai dû faire le travail. Il s'est vanté de n'avoir jamais perdu parce qu'il avait lu mes émotions. Je suis retourné chez moi et le lendemain je suis allé le voir. Regardez ce que je vous ai montré ici:",
        "p36":"Incroyable n ´est pas?",
        "p37":"Comme tous les débuts au début, apprendre quelque chose de nouveau sera lent. Cependant, en un rien de temps, vous rirez de tout cela.",
        "p38":"Et alors…",
        "p39":"Êtes-vous prêt pour les meilleurs conseils sur l'apprentissage non seulement de la programmation, mais de tout dans cette vie?",
        "p40":"N'abandonnez jamais. N'écoutez jamais quelqu'un qui vous dit que vous perdez votre temps, que vous êtes très jeune ou que vous êtes très vieux. Entourez-vous d'amis qui partagent les mêmes goûts. Posez-vous les problèmes et leur façon de les résoudre. Pratiquez et souvenez-vous. Le meilleur est à venir!",
        "p41":"PS: Voici d'autres livres que vous pouvez consulter lorsque vous le trouvez pertinent:",
        "p42":"Mettez-vous au travail, entourez-vous de Python, utilisez Internet, parlez, écoutez, pratiquez et surtout amusez-vous."
        
    }

}