{
    "inicio":{
        "p1":"बधाई हो",
        "p2":"मैं तुरंत आपके साथ संभावित तरीकों में से एक साझा करूंगा  आप एक प्रोग्रामिंग भाषा सीख सकते हैं।.",
        "p3":"मैं अपने अनुभव से आपसे बात करूंगा और मुझे उम्मीद है कि यह आपके लिए उपयोगी होगा।.",
        "p4":"एक भुगतान किया गया पाठ्यक्रम या एक विश्वविद्यालय की डिग्री सुपर वैध विकल्प हैं लेकिन अगर आपने अभी तक निर्णय नहीं लिया है या यह इस समय आपकी रुचि का नहीं है, तो जो जानकारी मैं प्रस्तुत करता हूं वह सबसे आकर्षक होगी।.",
        "p5":"यहां आपको किताबें, वेबसाइट, टिप्स, कोड सैंपल मिलेंगे। एक संगठित तरीके से सब कुछ ताकि आप तय कर सकें कि क्या करना है और कैसे करना है।.",
        "p6":"अगर मैं कर सकता हूं, तो मुझ पर विश्वास करो, तुम भी कर सकते हो। तुम भी पथ में सुधार कर सकते हैं और उन लोगों को इंगित कर सकते हैं जो आपके बाद आते हैं।.",
        "p7":"शायद एक दिन आप कुछ इस तरह से हल करेंगे और आप देखेंगे कि जादू मौजूद है:"
    },
    "navBar":{
        "p1":"शुरू",
        "p2":"मुझसे संपर्क करो"
    },
    "footer":{
        "p1":"अक्टूबर "
    },
    "page404":{
        "p1":"404 - नहीं मिला।! ",
        "p2":" अस्तित्व में नहीं है।... ",
        "p3":"शुरू"
    },
    "contacto":{
        "p1":"खुश हो जाओ!",
        "p2":"किसी भी कारण से बात करना, ज्ञान साझा करना और संपर्क में रहना अच्छा है।",
        "p3":"आपका नाम",
        "p4":"मुझे अपनी कहानी बताओ ...",
        "p5":"संदेश",
        "p6":"email@उदाहरण.com"
    },
    "mapView":{
        "p1":"नमस्ते! "

    },
    "buttonTop":{
        "p1":"यूपी। "

    },
    "metaTags":{
        "p1":"पायथन और JavaScript सीखने के लिए शीर्ष वेबसाइटें। पुस्तकें। युक्तियाँ। कोड उदाहरण।. "

    },
    "paypalButton":{
        "p1":"मुझे एक कॉफी के लिए आमंत्रित करें।."
    },
    "myHistoryJS":{
        "p1":"मेरी कहानी JavaScript के साथ",
        "p2":"आपने सोचा कि यात्रा वहीं समाप्त होगी, है ना?",
        "p3":"मनुष्य, बेहतर या बदतर के लिए, काफी असंतुष्ट है, और हमेशा अधिक चाहता है।.",
        "p4":"मैं जिज्ञासु था ... मैं निश्चित रूप से मानता हूं कि थोड़े समर्पण के साथ कुछ भी असंभव नहीं है और जब भी मुझे बिल्कुल भी पता नहीं था, तब सीखना हमेशा तेज होना चाहिए।.",
        "p5":"इसलिए पायथन के साथ 7 महीने के बाद मैंने JavaScript (HTML5 और CCS3 भी) सीखना शुरू कर दिया क्योंकि मैं वेब विकास के लिए आकर्षित हुआ, विशेष रूप से Front-End के रूप में जाना जाने वाला हिस्सा। इसके अलावा JavaScript को अन्य की तुलना में कम जटिल प्रोग्रामिंग भाषा भी माना जाता है। यह है कि केवल आपके कंप्यूटर पर स्थापित वेब ब्राउज़र के साथ आप कंसोल में काम कर सकते हैं जो एकीकृत है। एक चमत्कार।.",
        "p6":"मैं आपको बताता हूं कि, यद्यपि आप अपने कोड के स्वतः पूर्णता और संशोधन के लिए मनचाहा कार्यक्रम चुन सकते हैं, लेकिन Visual Studio Code से मेरे परिचितों के बीच एक मजबूत रुझान है। मैं पहले से ही क्यों महसूस कर रहा हूँ। इसे यहां से इंस्टॉल करें:",
        "p7":"आज JavasCript दुनिया में सबसे लोकप्रिय भाषाओं में से एक है और इसका उपयोग Web पेजों, प्रक्रिया डेटा के साथ-साथ विभिन्न प्रकार के एप्लिकेशन (मोबाइल एप्लिकेशन, डेस्कटॉप एप्लिकेशन, गेम आदि) बनाने के लिए अन्तरक्रियाशीलता को जोड़ने के लिए किया जाता है।.",
        "p8":"मेरी अन्य कहानी में उल्लिखित वेबसाइटों पर प्रोफाइल होने के बाद, मैंने खुद को सवाल पूछने और अध्ययन करने के लिए जानकारी इकट्ठा करने के लिए समर्पित किया। मैं इस बात पर जोर देता हूं कि मैं हमेशा भाषा के लिए पहला दृष्टिकोण रखने के लिए सोलोलाइन मोबाइल एप्लिकेशन का उपयोग करता हूं और इसके बाद मैं इसका अध्ययन और अभ्यास करने के लिए",
        "p9":"का उपयोग करता हूं। उपरोक्त, उन पुस्तकों के साथ, जिन्हें मैं तुरंत आपके साथ साझा करूंगा, मैं सबसे दिलचस्प मिश्रण मानता हूं।.",
        "p10":"आदत न खोने के लिए, यहां मैं आपको कुछ कार्यक्रम दिखाता हूं जो मैंने शुरुआत में किए थे:",
        "p11":" कुछ बिंदुओं पर मैं अपनी पत्नी के साथ राशियों के बारे में बात करना शुरू कर देता हूं और तारीखों आदि के साथ कुछ विवरणों को स्पष्ट करने के लिए मेरे पास जानकारी का कोई स्रोत नहीं है। तो पहली बात जो मैंने गंभीरता से इस भाषा में की वह निम्नलिखित थी:",
        "p12":"एक दिन मैं एक रेस्तरां में प्रवेश करने की प्रतीक्षा कर रहा था, जब मेरे पास लाइन का अनुकरण करने की कोशिश करने के लिए यह हुआ। यहां मैं आपको दिखाता हूं:",
        "p13":" मेरी पुरानी नौकरी में, यह आवश्यक था कि पार्किंग निर्देशांक और थियोडोलाइट के उन्मुखीकरण को देखते हुए, बाहर के कोण और तीसरे बिंदु की दूरी की गणना करने में सक्षम होने के लिए। मैंने इसे इस तरह हल किया: ",
        "p14":"ठीक है, कि मैं वर्तमान में क्या कर रहा हूँ। मैं एक JavaScript लाइब्रेरी का अध्ययन कर रहा हूं जिसे React.js के नाम से जाना जाता है। उसके साथ मैं इस तरह का ब्लॉग बना रहा हूं, जहां मैं आपको वह रास्ता दिखाता हूं, जिसका मैंने पालन किया और मैं खुद को इस क्षेत्र में जाना जाता हूं। मुझे लगता है कि यह जानकारी केवल इसलिए उपयोगी हो सकती है क्योंकि मैं चाहता हूं कि जब मैंने शुरुआत की थी तो मुझे कुछ ऐसा ही मिला था।.",
        "p15":"समय और अभ्यास के साथ मुझे उम्मीद है कि मैं गतिशील और दिलचस्प web पेज बनाने में सक्षम हूं। हमेशा एक समय में एक कदम, कि एक दिन के बाद एक से अधिक सुंदर कुछ भी नहीं है। यह सिर्फ शुरुआत है।.",
        "p16":"यह इस बिंदु पर है कि मैं न केवल HTML5, CCS3 और JavaScript बल्कि Python और बहुत कुछ जानने के लिए सबसे अच्छी वेबसाइट साझा करता हूं:",
        "p17":"यदि आप JavaScript सीखना चाहते हैं, और इसलिए web विकास, मुझे यकीन है कि आप अपने web ब्राउज़र को उसी तरह नहीं देखेंगे।.",
        "p18":"नेटवर्क पर मिलते हैं।."
    },
    "myHistoryPython":{
        "p1":"Python के साथ मेरा इतिहास",
        "p2":"अक्टूबर 2019 में प्रोग्रामिंग की दुनिया में मेरी यात्रा शुरू हुई।.",
        "p3":"वास्तव में!?",
        "p4":"अगर मैंने ऊपर कहा तो यह उचित नहीं होगा।.",
        "p5":"मुझे हमेशा प्रोग्रामिंग से मोहित किया गया है न कि केवल वर्तमान निर्धारण के साथ। पूर्व-विश्वविद्यालय में मैं अपना पहला कदम MSX-Basic के साथ ले रहा था, 1995 में वापस आ गया, लेकिन वहाँ यह सब था।",
        "p6":"समय बीत गया और यद्यपि मैं कंप्यूटर पर काम करने के लिए उत्सुक था, मेरे काम के विकल्प केवल Microsoft एक्सेल में एक स्प्रेडशीट में परिवर्तित हो गए जब मैं कुछ अतिरिक्त समस्या का सामना करने जा रहा था।.",
        "p7":"मुझे नहीं पता था कि किसी भी भाषा में प्रोग्राम कैसे किया जाता है (अभी तक: पी) लेकिन मुझे यकीन था कि यह कौशल तब उपयोगी हो सकता है जब मैं किसी समस्या का सामना करने जा रहा हूं, कार्य गतिविधि को आसान बनाने के लिए, आदि।.",
        "p8":"हमेशा यह विचार कि मैं अपनी गतिविधियों को स्वचालित कर सकता हूं, लेकिन मुझे क्या करना चाहिए ..., 38 साल की उम्र में, अध्ययन के लिए अधिक समय के बिना, निम्नलिखित प्रश्न उठता है:",
        "p9":"क्या प्रोग्रामिंग भाषा में एक सौम्य सीखने की अवस्था है, और इसका उपयोग कई गतिविधियों के लिए किया जा सकता है?",
        "p10":"अन्य भी हो सकते हैं लेकिन पायथन ने मेरी जिंदगी बदल दी।.",
        "p11":"पायथन एक उच्च-स्तरीय प्रोग्रामिंग भाषा है, जिसमें वेब विकास, स्क्रिप्टिंग, वैज्ञानिक कंप्यूटिंग और कृत्रिम बुद्धिमत्ता सहित कई क्षेत्रों में अनुप्रयोग हैं।.",
        "p12":"मैं इसके बारे में इनसाइट्स पर नहीं जा रहा हूं, लेकिन मैं आपके साथ वह सब कुछ साझा करने जा रहा हूं जो मैंने खुद को इस भाषा में विसर्जित करने के लिए खुद को पोषित किया, कालानुक्रमिक रूप से व्यवस्थित किया। तब मैं आपको इसे सीखने की सबसे अच्छी सलाह दूंगा।.",
        "p13":"पहली बात पायथन को स्थापित करना है, आधिकारिक पेज से:",
        "p14":"दूसरी बात यह है कि एक प्रोग्राम की तलाश करें जो हमें कोड स्वतः पूर्णता, सुझाव और अन्य सुविधाओं के साथ मदद करता है। बिंदु क्रमांक 4 में मैं आपको जो सुझाव देने जा रहा हूं, उस youtube पाठ्यक्रम में, शिक्षक ने Python 3 चुना। मैं उसी की सिफारिश करता हूं, हालांकि बाद में आप दूसरों को पाएंगे जो आपके लिए ब्याज की हो सकती है। आप इसे यहां डाउनलोड कर सकते हैं:",
        "p15":"। जैसा कि नाम से पता चलता है, यह पुस्तक शुरुआती लोगों के लिए है, यह सरल उदाहरणों के साथ अच्छी तरह से पुस्तक है। आपको यह ध्यान में रखना चाहिए कि यह पुस्तक पायथन 2 के बारे में है और संस्करण के संबंध में कुछ सिंटैक्स में परिवर्तन होता है जिसे आप निश्चित रूप से स्थापित करेंगे (पायथन 3) इसलिए इसमें अंतर होंगे, उदाहरण के लिए प्रिंट 2 + 3 बनाम प्रिंट (2 + 3), आदि। । लेकिन सूरज में धब्बे क्यों इंगित करते हैं :)",
        "p16":"Youtube कोर्स Píldoras Informáticas । प्रोफेसर जुआन डिआज़ आपको एक अति सुंदर यात्रा पर ले जाएगा, जहाँ शिक्षाशास्त्र और शिक्षाशास्त्र आपके प्रोग्रामर को आकार देगा। इस कोर्स के बाद आप निश्चित रूप से अपने पहले कार्यक्रमों को बनाने में सक्षम होंगे, जिनमें से आप हमेशा गर्व करेंगे। इस पर जाएँ और देखें कि आपको क्या लगता है: ",
        "p17":"वेबसाइट",
        "p18":"प्रोफेसर जुआन जोस लोज़ानो गोमेज़ आपको वास्तविकता से अधिक प्रासंगिक प्रोग्रामिंग की झलक देगा। यह आपको विभिन्न गतिविधियाँ करने के लिए अलग-अलग रूपरेखाएँ दिखाएगा। आपको महसूस होगा कि पाइथन ही अभी शुरुआत है, और यह केवल बेहतर हो सकता है। फिर मास्टर पाइथोनिस्ट बनें।",
        "p19":"मोबाइल एप्लिकेशन: SoloLearn । आपके मोबाइल डिवाइस पर यह एप्लिकेशन आपको इसे मजबूत बनाने के लिए सिद्धांत और प्रश्नों के साथ एक बहुत ही उद्देश्यपूर्ण तरीके से सीखने के लिए एक कोर्स (इस मामले में पायथन) का चयन करने की अनुमति देगा। इसलिए आप कहीं भी बैठकर या बिस्तर पर लेटकर आराम कर सकते हैं। इस एप्लिकेशन के पास कई विकल्प हैं जो आपको सुखद लगेंगे। जब आपके कोई प्रश्न हों, तो यह परामर्श का एक स्रोत भी हो सकता है। उनका समुदाय सक्रिय है और आप उन्हें अपनी पसंद की भाषा का उपयोग करके चुनौती दे सकते हैं। जैसे कि उपरोक्त सभी पर्याप्त नहीं थे, एक बार कोर्स पूरा होने के बाद आप एक डिजिटल प्रमाण पत्र प्राप्त करते हैं जो इसका समर्थन करता है। महान। यदि आप अपने कंप्यूटर पर हैं, तो मैं इस लिंक को आपके साथ साझा करूंगा, यदि आप खुद को परिचित करना चाहते हैं:",
        "p20":"आप उपरोक्त सभी में क्या करते हैं, विभिन्न वेबसाइटों पर प्रोफाइल क्यों नहीं बनाते हैं, जहाँ आप प्रश्न पूछ सकते हैं, कोड डाल सकते हैं या इस दुनिया में खुद को जान सकते हैं:",
        "p21":"यहां आप अपने विशिष्ट प्रश्न पूछ सकते हैं, जिसके लिए आपको कुछ पैटर्न का पालन करना होगा जो आप अपनी प्रोफ़ाइल बनाते समय सीखेंगे और पृष्ठ पर दिए गए निर्देशों का पालन करेंगे।.",
        "p22":"आप अपने इच्छित सभी कोड अपलोड कर पाएंगे और बहुत कुछ। मेरी राय में यह जरूरी है कि आपके पास उन सभी फायदों के लिए यहां एक खाता है जो आपको पेश कर सकते हैं।.",
        "p23":"काश एक वेबसाइट होती जो आपके कोड और अन्य चर को खाते में लेती, एक रैंकिंग बनाती और आपकी गतिविधि को ग्राफ़ करती ताकि इसे आसानी से प्रदर्शित किया जा सके ... यह मौजूद है और शानदार है।.",
        "p24":"चूँकि हम यहाँ हैं, इसलिए कानून के साथ जॉब प्रोफाइल क्यों नहीं बनाते। आप मुझसे सहमत होंगे कि इससे बेहतर कोई जगह नहीं है। यह जरूरी है कि आप खुद को इस तरह से जानते हैं। रिक्रूटर्स लगातार यह देखने के लिए जांच करते हैं कि कौन प्रतिभाशाली है और इस तरह उन्हें आकर्षित करता है, शायद, आदर्श नौकरी के लिए।.",
        "p25":" क्या आपको लगता है कि आपने ज्ञान प्राप्त कर लिया है और खुद को चुनौती देना चाहते हैं? खैर, यह एसिड परीक्षण का समय है। मैं आपके साथ एक पेज साझा करने जा रहा हूं, जो मुझे आदी है:",
        "p26":"। इसमें आप उन भाषाओं में अभ्यास करने में सक्षम होंगे जो इसे एक मनोरंजक और गतिशील तरीके से उपलब्ध हैं, कई डेटा इनपुट के साथ अपने कोड का ठीक से परीक्षण करने के लिए और जैसे कि जब आप तैयार महसूस करते हैं तो पर्याप्त नहीं थे आप अपने ज्ञान को प्रमाणित करने और डिप्लोमा प्राप्त करने के लिए परीक्षा दे सकते हैं। ईमानदारी से, मुझे कुछ भी बेहतर नहीं मिला।",
        "p27":"जब आप आरजीबी रंग (25, 169, 77) से थोड़ा ऊब जाते हैं, तो मैं एक और पेज प्रस्तावित करता हूं, जहां आप अपने कौशल का अभ्यास कर सकते हैं:",
        "p28":"। माननीय इंद्रिय, चलो कटास का अभ्यास करें!",
        "p29":"खुश हो जाओ, एक बार यह यात्रा शुरू हो गई है, कुछ भी पहले जैसा नहीं होगा।.",
        "p30":"यदि आप जल्दी शुरू करते हैं, तो आप एक सहयोगी उपकरण के रूप में होने वाले कार्यों का सामना करने में सक्षम होंगे। यदि आप मेरी जैसी उम्र में शुरू करते हैं तो उन समस्याओं को हल करने में सक्षम नहीं थे और जो आपको रात में सताती हैं, उन्हें निष्पादित किया जा सकता है।.",
        "p31":"अब मैं कुछ कार्यक्रमों का उल्लेख करता हूं जो मैंने अपनी चिंताओं को पूरा करने के लिए किया था:",
        "p32":"मेरा पसंदीदा खेल फुटबॉल और अच्छा है, मैंने जो पहला कार्यक्रम गंभीरता से किया था वह एक फुटबॉल विश्व कप सिम्युलेटर था, मुझे अभी तक संभावनाएं जोड़ना है क्योंकि अभी सभी परिणाम यादृच्छिक हैं लेकिन जब मैंने इसे पूरा किया तो यह संतोषजनक था।",
        "p33":"में उन्होंने मेरे विशेष प्रश्नों का उत्तर दिया और यह कि मैं कैसे - करके सीख रहा था। यहां कोड के साथ मज़े करें:",
        "p34":" मैंने एक बार ऐसी जगह काम किया था जहाँ माल पहुँचाया जाता था। ये माल कंटेनर में आया था। मुझे याद है कि मैंने और मेरे सहयोगियों ने माइक्रोसॉफ्ट एक्सेल शीट में एक निश्चित कंटेनर के बारे में जानकारी की तलाश में हास्यास्पद समय बिताया था जिसमें बहुत सारी जानकारी थी। आप यहां खोज को अनुकूलित करने के लिए एक कोड पा सकते हैं: ",
        "p35":" एक दिन मैं एक दोस्त के साथ बात कर रहा था और एक निर्णय लेने के लिए हमने रॉक - पेपर - कैंची खेलने का फैसला किया। मैं हार गया और नौकरी करनी पड़ी। उसने डींग मार दी कि वह कभी नहीं हारा क्योंकि उसने मेरी भावनाओं को पढ़ा। मैं अपने घर वापस चला गया और अगले दिन मैं उसे देखने गया। देखो मैंने तुम्हें यहाँ क्या दिखाया: ",
        "p36":"अतुल्य सच?",
        "p37":"शुरुआत में सभी सीखने की तरह कुछ नया धीमा होगा। हालाँकि, कुछ ही समय में आप इस सब से हँसेंगे।.",
        "p38":"इसलिए…",
        "p39":"क्या आप न सिर्फ प्रोग्रामिंग, बल्कि इस जीवन में कुछ भी सीखने के लिए सबसे अच्छी सलाह के लिए तैयार हैं?",
        "p40":"कभी हार मत मानो। कभी भी किसी की न सुनें जो आपसे कहे कि आप अपना समय बर्बाद कर रहे हैं, या कि आप बहुत छोटे हैं, या कि आप बहुत बूढ़े हैं। अपने आप को उन दोस्तों के साथ घेरें जो समान स्वाद साझा करते हैं। खुद से समस्याएं और उनके समाधान का तरीका पूछें। अभ्यास करें और याद रखें। अभी तो इससे भी अच्छा आना बाकी है!",
        "p41":"PS: यहां अन्य पुस्तकें हैं जिन्हें आप प्रासंगिक होने पर परामर्श कर सकते हैं:",
        "p42":"काम पर जाओ, अपने आप को Python के साथ घेरो, इंटरनेट का उपयोग करें, बात करें, सुनें, अभ्यास करें और सबसे ऊपर मज़े करें।."
        
    }



}