{
    "inicio":{
        "p1":"поздравления",
        "p2":"Сразу поделюсь с вами одним из возможных способов, которыми вы можете изучить язык программирования.",
        "p3":"Я расскажу вам о своем опыте и надеюсь, что это будет вам полезно.",
        "p4":"Платный курс или высшее образование - супер действительные варианты, НО если вы еще не решили или это не представляет для вас интереса в настоящий момент, информация, которую я представляю, будет наиболее привлекательной.",
        "p5":"Здесь вы найдете книги, веб-сайты, советы, образцы кода. Все организовано, так что вы можете решить, что и как делать.",
        "p6":"Если я могу, поверьте мне, вы тоже сможете. Вы даже можете улучшить путь и указать на него тем, кто придет после вас.",
        "p7":"Возможно, однажды вы решите что-то подобное и увидите, что магия действительно существует:"
    },
    "navBar":{
        "p1":"Начало",
        "p2":"свяжитесь со мной"
    },
    "footer":{
        "p1":"Октябрь"
    },
    "page404":{
        "p1":"404 - Не найдено! ",
        "p2":" не существует... ",
        "p3":"Начало"
    },
    "contacto":{
        "p1":"Взбодриться!",
        "p2":"Любая причина хороша для разговора, обмена знаниями и поддержания связи.",
        "p3":"ваше имя",
        "p4":"расскажи мне свою историю ...",
        "p5":"Послать",
        "p6":"email@пример.com"

    },
    "mapView":{
        "p1":"Здравствуй! "

    },
    "buttonTop":{
        "p1":"вверх"

    },
    "metaTags":{
        "p1":"Основные сайты для изучения Python и JavaScript. Книги. Подсказки. Примеры кода."
    },
    "paypalButton":{
        "p1":"пригласи меня на кофе."
    },
    "myHistoryJS":{
        "p1":"моя история с JavaScript",
        "p2":"Вы думали, что на этом поездка закончится?",
        "p3":"Человек, к лучшему или к худшему, очень недоволен и всегда хочет большего.",
        "p4":"Мне было любопытно… Я определенно считаю, что нет ничего невозможного с небольшой самоотдачей, и обучение всегда будет быстрее, чем когда я вообще не знал.",
        "p5":"Итак, после 7 месяцев работы с Python я начал изучать JavaScript (в том числе HTML и CSS), потому что меня привлекала веб-разработка, в частности часть, известная как Front-End. Кроме того, Javascript также считается менее сложным языком программирования, чем другие. Дело в том, что с помощью только установленного на вашем компьютере веб-браузера вы можете выполнять действия в интегрированной консоли. Чудо.",
        "p6":"Я говорю вам, что, хотя вы можете выбрать нужную программу для автозаполнения и доработки вашего кода, среди моих знакомых наблюдается сильная тенденция по Visual Studio Code. Я уже понимаю почему. Установите его отсюда:",
        "p7":"Сегодня Javascript является одним из самых популярных языков в мире и используется для добавления интерактивности веб-страницам, обработки данных, а также для создания различных типов приложений (мобильных приложений, настольных приложений, игр и т. Д.)",
        "p8":"Имея профили на веб-сайтах, упомянутых в другом моем рассказе, я посвятил себя задаче вопросов и сбору информации для изучения. Я подчеркиваю, что я всегда обращаюсь к мобильному приложению SoloLearn, чтобы получить первый подход к языку, и автоматически после этого я использую",
        "p9":"для изучения и практики. Вышеупомянутое, вместе с книгами, которыми я с вами сразу поделюсь, я считаю смесью самых интересных.",
        "p10":"Чтобы не потерять привычку, здесь я покажу вам несколько программ, которые я сделал в начале:",
        "p11":"В какой-то момент я начинаю говорить с женой о знаках зодиака, и у меня не было под рукой источника информации, чтобы уточнить некоторые детали с датами и т. Д. Итак, первое, что я серьезно сделал на этом языке, было следующее:",
        "p12":"Однажды я ждал входа в ресторан, когда мне пришло в голову попытаться смоделировать очередь. Здесь я показываю вам:",
        "p13":"На моей старой работе было необходимо, учитывая координаты парковки и ориентацию теодолита, чтобы иметь возможность рассчитать угол разбивки и расстояние до третьей точки. Я решил это так:",
        "p14":"Ну, вот чем я сейчас занимаюсь. Я изучаю библиотеку JavaScript, известную как React.js. Вместе с ней я веду такой блог, где показываю вам путь, по которому я шел, а также заявляю о себе в этой области. Я думаю, что эта информация может быть полезна просто потому, что мне жаль, что я не нашел что-то подобное, когда начинал.",
        "p15":"Со временем и практикой я надеюсь, что смогу создавать динамичные и интересные веб-страницы. Всегда шаг за шагом, что нет ничего прекраснее дня за днем. Это только начало.",
        "p16":"Именно здесь я поделюсь с вами лучшим веб-сайтом для изучения не только HTML5, CCS3 и JavaScript, но также Python и многого другого:",
        "p17":"Если вы хотите изучить Javascript и, следовательно, веб-разработку, я уверен, что вы не будете видеть свой веб-браузер таким же образом.",
        "p18":"Увидимся в сетях."
    }



}