{
    "inicio":{
        "p1":"поздравления",
        "p2":"Сразу поделюсь с вами одним из возможных способов, которыми вы можете изучить язык программирования.",
        "p3":"Я расскажу вам о своем опыте и надеюсь, что это будет вам полезно.",
        "p4":"Платный курс или высшее образование - супер действительные варианты, НО если вы еще не решили или это не представляет для вас интереса в настоящий момент, информация, которую я представляю, будет наиболее привлекательной.",
        "p5":"Здесь вы найдете книги, веб-сайты, советы, образцы кода. Все организовано, так что вы можете решить, что и как делать.",
        "p6":"Если я могу, поверьте мне, вы тоже сможете. Вы даже можете улучшить путь и указать на него тем, кто придет после вас.",
        "p7":"Возможно, однажды вы решите что-то подобное и увидите, что магия действительно существует:"
    },
    "navBar":{
        "p1":"Начало",
        "p2":"свяжитесь со мной"
    },
    "footer":{
        "p1":"Октябрь"
    },
    "page404":{
        "p1":"404 - Не найдено! ",
        "p2":" не существует... ",
        "p3":"Начало"
    },
    "contacto":{
        "p1":"Взбодриться!",
        "p2":"Любая причина хороша для разговора, обмена знаниями и поддержания связи.",
        "p3":"ваше имя",
        "p4":"расскажи мне свою историю ...",
        "p5":"Послать",
        "p6":"email@пример.com"

    },
    "mapView":{
        "p1":"Здравствуй! "

    },
    "buttonTop":{
        "p1":"вверх"

    },
    "metaTags":{
        "p1":"Основные сайты для изучения Python и JavaScript. Книги. Подсказки. Примеры кода."
    },
    "paypalButton":{
        "p1":"пригласи меня на кофе."
    },
    "myHistoryJS":{
        "p1":"моя история с JavaScript",
        "p2":"Вы думали, что на этом поездка закончится?",
        "p3":"Человек, к лучшему или к худшему, очень недоволен и всегда хочет большего.",
        "p4":"Мне было любопытно… Я определенно считаю, что нет ничего невозможного с небольшой самоотдачей, и обучение всегда будет быстрее, чем когда я вообще не знал.",
        "p5":"Итак, после 7 месяцев работы с Python я начал изучать JavaScript (в том числе HTML и CSS), потому что меня привлекала веб-разработка, в частности часть, известная как Front-End. Кроме того, Javascript также считается менее сложным языком программирования, чем другие. Дело в том, что с помощью только установленного на вашем компьютере веб-браузера вы можете выполнять действия в интегрированной консоли. Чудо.",
        "p6":"Я говорю вам, что, хотя вы можете выбрать нужную программу для автозаполнения и доработки вашего кода, среди моих знакомых наблюдается сильная тенденция по Visual Studio Code. Я уже понимаю почему. Установите его отсюда:",
        "p7":"Сегодня Javascript является одним из самых популярных языков в мире и используется для добавления интерактивности веб-страницам, обработки данных, а также для создания различных типов приложений (мобильных приложений, настольных приложений, игр и т. Д.)",
        "p8":"Имея профили на веб-сайтах, упомянутых в другом моем рассказе, я посвятил себя задаче вопросов и сбору информации для изучения. Я подчеркиваю, что я всегда обращаюсь к мобильному приложению SoloLearn, чтобы получить первый подход к языку, и автоматически после этого я использую",
        "p9":"для изучения и практики. Вышеупомянутое, вместе с книгами, которыми я с вами сразу поделюсь, я считаю смесью самых интересных.",
        "p10":"Чтобы не потерять привычку, здесь я покажу вам несколько программ, которые я сделал в начале:",
        "p11":"В какой-то момент я начинаю говорить с женой о знаках зодиака, и у меня не было под рукой источника информации, чтобы уточнить некоторые детали с датами и т. Д. Итак, первое, что я серьезно сделал на этом языке, было следующее:",
        "p12":"Однажды я ждал входа в ресторан, когда мне пришло в голову попытаться смоделировать очередь. Здесь я показываю вам:",
        "p13":"На моей старой работе было необходимо, учитывая координаты парковки и ориентацию теодолита, чтобы иметь возможность рассчитать угол разбивки и расстояние до третьей точки. Я решил это так:",
        "p14":"Ну, вот чем я сейчас занимаюсь. Я изучаю библиотеку JavaScript, известную как React.js. Вместе с ней я веду такой блог, где показываю вам путь, по которому я шел, а также заявляю о себе в этой области. Я думаю, что эта информация может быть полезна просто потому, что мне жаль, что я не нашел что-то подобное, когда начинал.",
        "p15":"Со временем и практикой я надеюсь, что смогу создавать динамичные и интересные веб-страницы. Всегда шаг за шагом, что нет ничего прекраснее дня за днем. Это только начало.",
        "p16":"Именно здесь я поделюсь с вами лучшим веб-сайтом для изучения не только HTML5, CCS3 и JavaScript, но также Python и многого другого:",
        "p17":"Если вы хотите изучить Javascript и, следовательно, веб-разработку, я уверен, что вы не будете видеть свой веб-браузер таким же образом.",
        "p18":"Увидимся в сетях."
    },
    "myHistoryPython":{
        "p1":"моя история с Python",
        "p2":"В октябре 2019 года началось мое путешествие в мир программирования.",
        "p3":"В самом деле!?",
        "p4":"Было бы несправедливо, если бы я сказал выше.",
        "p5":"Меня всегда увлекало программирование, но не нынешняя решимость. Еще в доуниверситете я делал свои первые шаги с «MSX-Basic» еще в 1995 году, но на этом все и закончилось.",
        "p6":"Прошло время, и хотя я очень хотел поработать на компьютере, мои варианты работы сводились к электронной таблице в Microsoft Excel только тогда, когда я собирался столкнуться с какой-то дополнительной проблемой.",
        "p7":"Я не знал, как программировать на каком-либо языке (пока: P), но я был уверен, что обладание этим навыком может быть полезно, когда я столкнусь с проблемой, для облегчения работы и т. Д.",
        "p8":"Меня всегда преследовала мысль о том, что я могу автоматизировать свою деятельность, но что делать ... в 38 лет, не имея времени на учебу, возникает следующий вопрос:",
        "p9":"Какой язык программирования требует плавного изучения и может использоваться для многих задач?",
        "p10":"Могут быть и другие, но Python изменил мою жизнь.",
        "p11":"Python - это язык программирования высокого уровня с приложениями во многих областях, включая веб-разработку, создание сценариев, научные вычисления и искусственный интеллект.",
        "p12":"Я не собираюсь останавливаться на его деталях, но я собираюсь поделиться с вами всем, чем я питался, чтобы погрузиться в этот язык, в хронологическом порядке. Тогда я дам вам лучший совет, чтобы узнать это.",
        "p13":"Первым делом установите Python с официальной страницы:",
        "p14":"Во-вторых, нужно искать программу, которая поможет нам с автозаполнением кода, предложениями и другими возможностями. В курсе YouTube, который я собираюсь предложить вам в пункте № 4, учитель выбрал «Sublime Text 3». Я рекомендую то же самое, хотя позже вы найдете другие, которые могут быть вам интересны. Вы можете скачать его здесь:",
        "p15":"Как следует из названия, эта книга для начинающих, она хорошо написана простыми примерами. Вы должны помнить, что эта книга посвящена Python 2 и некоторым изменениям синтаксиса по отношению к версии, которую вы обязательно установите (Python 3), поэтому будут различия, например print 2 + 3 vs print (2 + 3) и т. Д. . Но зачем указывать на пятна на солнце :)",
        "p16":"Youtube-курс Píldoras Informáticas. Профессор Хуан Диас проведет вас за руку в изысканное путешествие, в котором педагогика и дидактика сформируют в вас программиста. После этого курса вы обязательно сможете создавать свои первые программы, которыми вы всегда будете гордиться. Посетите его и узнайте, что вы думаете:",
        "p17":"Сайт www",
        "p18":"Профессор Хуан Хосе Лосано Гомес познакомит вас с программированием, более контекстуализированным к реальности. Он покажет вам разные структуры для выполнения разных действий. Вы поймете, что «Python» - это только начало, и это может только улучшиться. Тогда станьте мастером питонистов.",
        "p19":"Мобильное приложение: «SoloLearn». Это приложение на вашем мобильном устройстве позволит вам выбрать курс (в данном случае Python) для очень объективного изучения вместе с теорией и вопросами для ее подкрепления. Таким образом, вы можете заниматься где угодно, пока вы отдыхаете, сидя или лежа в постели. В этом приложении есть несколько вариантов, которые вам понравятся. Кроме того, он также может быть источником консультации, если у вас возникнут какие-либо вопросы. Их сообщество активно, и вы можете бросить им вызов, используя предпочитаемый вами язык. Как будто всего вышеперечисленного было недостаточно, по завершении курса вы получите цифровой сертификат, который его поддерживает. Отлично. Если вы находитесь на своем компьютере, я поделюсь с вами этой ссылкой, если вы захотите ознакомиться:",
        "p20":"В том, что вы делаете во всем вышеперечисленном, почему бы не создать профили на разных веб-сайтах, где вы можете задавать вопросы, размещать код или заявлять о себе в этом мире:",
        "p21":"Здесь вы можете задать свои конкретные вопросы, для которых вы должны следовать некоторым шаблонам, которые вы узнаете, когда создадите свой профиль и будете следовать инструкциям на странице.",
        "p22":"Вы сможете загрузить любой код, который хотите, и многое другое. На мой взгляд, крайне важно, чтобы у вас была учетная запись, чтобы воспользоваться всеми преимуществами, которые она может вам предложить.",
        "p23":"Хотелось бы, чтобы был веб-сайт, который, принимая во внимание ваш код и другие переменные, создавал бы рейтинг и график вашей активности, чтобы ее можно было легко отобразить ... он существует и великолепен.",
        "p24":"Раз уж мы находимся здесь, почему бы не составить профиль работы в соответствии со всем законом. Вы согласитесь со мной, что нет лучшего места, чем это. Совершенно необходимо, чтобы вы заявили о себе таким образом. Рекрутеры постоянно проверяют, кто талантлив, и таким образом привлекают их, возможно, на идеальную работу.",
        "p25":"Вы думаете, что приобрели знания и хотите испытать себя? Что ж, пришло время кислотного теста. Я собираюсь поделиться с вами страницей, к которой я пристрастился:",
        "p26":"В нем вы сможете практиковаться на языках, которые он имеет, в увлекательной и динамичной форме, с множеством вводимых данных для правильного тестирования вашего кода, и, как будто этого было недостаточно, когда вы почувствуете себя готовым, вы можете сдать экзамены, чтобы подтвердить свои знания и получить дипломы. Честно говоря, лучше не нашел.",
        "p27":"Если вам немного надоедает цвет rgb (25, 169, 77), я предлагаю другую страницу, где вы можете попрактиковаться в своих навыках:",
        "p28":"Почитай сенсея, давай попрактикуемся в ката!",
        "p29":"Поднимите настроение, как только начнется это путешествие, все будет как прежде.",
        "p30":"Если вы начнете рано, вы сможете решать задачи, имея в качестве союзника мощный инструмент. Если ты начнешь в таком же возрасте, как мой, то те проблемы, которые ты не мог решить и которые мучили тебя по ночам, могут быть выполнены.",
        "p31":"Теперь я упоминаю некоторые программы, которые я сделал, когда начал удовлетворять свои опасения:",
        "p32":"Мой любимый вид спорта - футбол, и ну, первая программа, которую я серьезно разработал, была симулятором чемпионата мира по футболу, я еще не добавил вероятностей, потому что сейчас все результаты случайны, но когда я закончил, они были удовлетворительными. На сайте",
        "p33":"они ответили на мои конкретные вопросы, и именно так я учился на практике. Получайте удовольствие от кода здесь:",
        "p34":"Однажды я работал в месте, куда возили товары. Товар поступал в контейнерах. Я помню, что мы с коллегами потратили невероятное количество времени на поиск информации об определенном контейнере в таблице Microsoft Excel, в которой было много информации. Вы можете найти код для оптимизации поиска здесь:",
        "p35":"Однажды я разговаривал с другом, и, чтобы принять решение, мы решили сыграть в камень-ножницы-бумага. Я проиграл, и мне пришлось делать работу. Он хвастался, что никогда не проигрывал, потому что читал мои эмоции. Я вернулся к себе домой и на следующий день пошел к нему. Посмотрите, что я вам здесь показал:",
        "p36":"Невероятная правда?",
        "p37":"Как и все начинания вначале, изучение чего-то нового будет медленным. Однако вы сразу же будете смеяться над всем этим.",
        "p38":"Так…",
        "p39":"Готовы ли вы получить лучший совет по изучению не только программирования, но и всего в этой жизни?",
        "p40":"Никогда не сдавайся. Никогда не слушайте того, кто говорит вам, что вы зря тратите время, или что вы очень молоды, или что вы очень стары. Окружите себя друзьями с одинаковыми вкусами. Задайте себе проблемы и способы их решения. Практикуйтесь и помните. Лучшее еще впереди!",
        "p41":"PS: Вот другие книги, к которым вы можете обратиться, если сочтете это актуальным:",
        "p42":"Приступайте к работе, окружайте себя Python, пользуйтесь Интернетом, разговаривайте, слушайте, практикуйтесь и, прежде всего, получайте удовольствие."
        
    }



}